{
	"version": "https://jsonfeed.org/version/1",
	"title": "scraps of poetry and madness",
	"icon": "https://micro.blog/poetryandmadness/avatar.jpg",
	"home_page_url": "https://poetryandmadness.micro.blog/",
	"feed_url": "https://poetryandmadness.micro.blog/feed.json",
	"items": [
		
			{
				"id": "http://poetryandmadness.micro.blog/2024/05/18/godzilla-vs-mechagodzilla.html",
				"title": "Godzilla vs Mechagodzilla II (1993)",
				"content_html": "<!-- raw HTML omitted -->\n<p><!-- raw HTML omitted -->Part of my <a href=\"https://poetryandmadness.micro.blog/2024/05/09/godzilla-heisei-era.html\">series of reviews</a> of the <a href=\"https://wikizilla.org/wiki/Heisei_era\">Heisei era</a> Godzilla movies. <strong>Spoilers within</strong>, but we&rsquo;re talking 90&rsquo;s Godzilla movies here.</p>\n<p>Spoiler alert: Godzilla fights a giant robot shaped like him. Again.<!-- raw HTML omitted --></p>\n<p>Now THIS is what I&rsquo;m talking about. Just a simple sci-fi action flick that also ends up having a lot of heart. I love pretty much everything about this one. Even Rodan! That bastard actually ends up being a bro in this one!</p>\n<p>What&rsquo;s not to like? Mechagodzilla is legit cool looking and intimidating. Baby Godzilla is cute and expressive. The humans are pretty interesting, if not the most well-developed the series has seen. And so much Godzilla screen time! Apparently, <a href=\"https://wikizilla.org/wiki/Godzilla_vs._Mechagodzilla_II#Trivia\">this is the most he&rsquo;s been on screen</a> in the whole series, and it shows.</p>\n<p>The monsters really steal the show here, and actually have pretty developed and interesting motivations. Is Rodan stealing eggs or protecting his &ldquo;step brother&rdquo;? I was actually invested in figuring this out, and I usually hate that guy. Godzilla has a pretty clear motivation and once his through-line has concluded, he just walks away in the end. The humans don&rsquo;t win, but things actually resolve.</p>\n<p>The movie is paced well and doesn&rsquo;t waste any time getting into cool looking sci-fi monster mayhem. Baby Godzilla, which shouldn&rsquo;t work at all, totally steals the show and never gets too cutesie or annoying. And Miki the psychic actually has things to do!</p>\n<p>This is a good one and it will be hard to beat as my favorite of the Heisei era. Can <a href=\"https://wikizilla.org/wiki/SpaceGodzilla\">CrystalShoulderPadsZilla</a> do it? We&rsquo;ll see!</p>\n<p><strong>Rating:</strong> 4+/5<br>\n<strong>Watched:</strong> 28 February 2024</p>\n",
				"content_text": "<img src=\"https://poetryandmadness.micro.blog/uploads/2024/godzilla-vs-mechagodzilla-2-textless-poster.jpg\" width=\"600\" height=\"852\" alt=\"\">\n\n<i>Part of my [series of reviews](https://poetryandmadness.micro.blog/2024/05/09/godzilla-heisei-era.html) of the [Heisei era](https://wikizilla.org/wiki/Heisei_era) Godzilla movies. **Spoilers within**, but we're talking 90's Godzilla movies here. \n\nSpoiler alert: Godzilla fights a giant robot shaped like him. Again.</i>\n\nNow THIS is what I'm talking about. Just a simple sci-fi action flick that also ends up having a lot of heart. I love pretty much everything about this one. Even Rodan! That bastard actually ends up being a bro in this one!\n\nWhat's not to like? Mechagodzilla is legit cool looking and intimidating. Baby Godzilla is cute and expressive. The humans are pretty interesting, if not the most well-developed the series has seen. And so much Godzilla screen time! Apparently, [this is the most he's been on screen](https://wikizilla.org/wiki/Godzilla_vs._Mechagodzilla_II#Trivia) in the whole series, and it shows.\n\nThe monsters really steal the show here, and actually have pretty developed and interesting motivations. Is Rodan stealing eggs or protecting his \"step brother\"? I was actually invested in figuring this out, and I usually hate that guy. Godzilla has a pretty clear motivation and once his through-line has concluded, he just walks away in the end. The humans don't win, but things actually resolve. \n\nThe movie is paced well and doesn't waste any time getting into cool looking sci-fi monster mayhem. Baby Godzilla, which shouldn't work at all, totally steals the show and never gets too cutesie or annoying. And Miki the psychic actually has things to do! \n\nThis is a good one and it will be hard to beat as my favorite of the Heisei era. Can [CrystalShoulderPadsZilla](https://wikizilla.org/wiki/SpaceGodzilla) do it? We'll see!\n\n**Rating:** 4+/5  \n**Watched:** 28 February 2024\n",
				"date_published": "2024-05-18T11:00:00-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/05/18/godzilla-vs-mechagodzilla.html",
				"tags": ["reviews","Godzilla"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/05/14/godzilla-and-mothra.html",
				"title": "Godzilla and Mothra: Battle for Earth (1992)",
				"content_html": "<!-- raw HTML omitted -->\n<p><!-- raw HTML omitted -->Part of my <a href=\"https://poetryandmadness.micro.blog/2024/05/09/godzilla-heisei-era.html\">series of reviews</a> of the <a href=\"https://wikizilla.org/wiki/Heisei_era\">Heisei era</a> Godzilla movies. <strong>Spoilers within</strong>, but we&rsquo;re talking 90&rsquo;s Godzilla movies here.</p>\n<p>Spoiler alert: Mothra upstages Godzilla. Again.<!-- raw HTML omitted --></p>\n<p>Whereas <a href=\"\"><em>Godzilla vs King Ghidorah</em></a> tried to do <em>a lot</em>, this one tries to do one thing and does it over and over and over: remind us humans that we are ruining the earth. Godzilla movies are not known for their subtlety but this one was so heavy handed with the environmental message - which itself is never more nuanced than, &ldquo;We&rsquo;re doing bad things and we should stop&rdquo; - that it becomes annoying and boring. It doesn&rsquo;t help we have some pretty forgettable human characters, and frankly, even Godzilla himself doesn&rsquo;t have much to do in this one. Apparently this was originally <a href=\"https://wikizilla.org/wiki/Mothra_vs._Bagan#Trivia\">a Mothra movie</a> script that they adapted into a Godzilla movie, and it really shows. Godzilla has so little bearing on the plot that it wouldn&rsquo;t be hard to imagine a version of this without him all together. That&rsquo;s a problem for a, ya know, Godzilla movie.</p>\n<p>So many of the human characters are just here to say the same ham-fisted environmental message over and over. The two leads, Takuya and his ex-wife Masako, could have been interesting with their reconciliation plot, but instead their plot is just kind of boring. Not to mention the fact that Takuya makes such an out-of-nowhere decision that seems totally counter to what little character development he had: namely stealing and trying to sell the <a href=\"https://wikizilla.org/wiki/Shobijin#Heisei_era\">Cosmos</a>. It makes no sense! And it&rsquo;s completely unnecessary! The Cosmos have <em>already</em> been stolen by someone else, motivating Mothra&rsquo;s attack! There is literally no reason for him to do this; they could have reconciled him with his family in any number of other, more sensical ways.</p>\n<p>Also, while I love Mothra, I always get bored when she spends half a movie as a caterpillar. Mothra as a moth always looks so rad. Who actually is interested in seeing a pink slug for half the movie? Give us the Queen of the Monsters at her most regal!</p>\n<p>One high point though was the score, especially the Mothra themes. Also Battra is generally a pretty cool design, even in <!-- raw HTML omitted -->Metapod<!-- raw HTML omitted --> caterpillar form. The undersea battle between him and Godzilla was exciting and felt different. Also, I really like the actor playing Ando, mainly because he&rsquo;s one of my favorite human character in the franchise, playing the dad, Yuji Shinoda, in <a href=\"https://wikizilla.org/wiki/Godzilla_2000:_Millennium\"><em>Godzilla 2000</em></a>.</p>\n<p>Overall, a pretty mediocre, borderline forgettable Godzilla movie.</p>\n<p><strong>Rating:</strong> 2+/5<br>\n<strong>Watched:</strong> 27 February 2024</p>\n",
				"content_text": "<img src=\"https://poetryandmadness.micro.blog/uploads/2024/godzilla-and-mothra-battle-textless-poster.jpg\" width=\"600\" height=\"853\" alt=\"\">\n\n<i>Part of my [series of reviews](https://poetryandmadness.micro.blog/2024/05/09/godzilla-heisei-era.html) of the [Heisei era](https://wikizilla.org/wiki/Heisei_era) Godzilla movies. **Spoilers within**, but we're talking 90's Godzilla movies here.  \n\nSpoiler alert: Mothra upstages Godzilla. Again.</i>\n\nWhereas [_Godzilla vs King Ghidorah_]() tried to do _a lot_, this one tries to do one thing and does it over and over and over: remind us humans that we are ruining the earth. Godzilla movies are not known for their subtlety but this one was so heavy handed with the environmental message - which itself is never more nuanced than, \"We're doing bad things and we should stop\" - that it becomes annoying and boring. It doesn't help we have some pretty forgettable human characters, and frankly, even Godzilla himself doesn't have much to do in this one. Apparently this was originally [a Mothra movie](https://wikizilla.org/wiki/Mothra_vs._Bagan#Trivia) script that they adapted into a Godzilla movie, and it really shows. Godzilla has so little bearing on the plot that it wouldn't be hard to imagine a version of this without him all together. That's a problem for a, ya know, Godzilla movie.\n\nSo many of the human characters are just here to say the same ham-fisted environmental message over and over. The two leads, Takuya and his ex-wife Masako, could have been interesting with their reconciliation plot, but instead their plot is just kind of boring. Not to mention the fact that Takuya makes such an out-of-nowhere decision that seems totally counter to what little character development he had: namely stealing and trying to sell the [Cosmos](https://wikizilla.org/wiki/Shobijin#Heisei_era). It makes no sense! And it's completely unnecessary! The Cosmos have *already* been stolen by someone else, motivating Mothra's attack! There is literally no reason for him to do this; they could have reconciled him with his family in any number of other, more sensical ways. \n\nAlso, while I love Mothra, I always get bored when she spends half a movie as a caterpillar. Mothra as a moth always looks so rad. Who actually is interested in seeing a pink slug for half the movie? Give us the Queen of the Monsters at her most regal!\n\nOne high point though was the score, especially the Mothra themes. Also Battra is generally a pretty cool design, even in <s>Metapod</s> caterpillar form. The undersea battle between him and Godzilla was exciting and felt different. Also, I really like the actor playing Ando, mainly because he's one of my favorite human character in the franchise, playing the dad, Yuji Shinoda, in [_Godzilla 2000_](https://wikizilla.org/wiki/Godzilla_2000:_Millennium).\n\nOverall, a pretty mediocre, borderline forgettable Godzilla movie.\n\n**Rating:** 2+/5  \n**Watched:** 27 February 2024\n",
				"date_published": "2024-05-14T11:00:00-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/05/14/godzilla-and-mothra.html",
				"tags": ["reviews","Godzilla"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/05/11/godzilla-vs-king.html",
				"title": "Godzilla vs King Ghidorah (1991)",
				"content_html": "<!-- raw HTML omitted -->\n<p><!-- raw HTML omitted -->Part of my <a href=\"https://poetryandmadness.micro.blog/2024/05/09/godzilla-heisei-era.html\">series of reviews</a> of the <a href=\"https://wikizilla.org/wiki/Heisei_era\">Heisei era</a> Godzilla movies. <strong>Spoilers within</strong>, but we&rsquo;re talking 90&rsquo;s Godzilla movies here.</p>\n<p>Spoiler alert: White people ruin everything. Again.<!-- raw HTML omitted --></p>\n<p>This movie tried to do a lot, and while I&rsquo;m not sure how much it succeeded in most of it, I can&rsquo;t deny it was enjoyable and engaging.</p>\n<p>The plot is overly-complicated, and the time travel doesn&rsquo;t even hold up to most pop-culture time travel logical standards. The movie really wants to say <em>something</em> about Japan&rsquo;s complicated relationship with 1) Godzilla, 2) the West, 3) Nuclear power; and while it does indeed Say Things about all of that&hellip; I&rsquo;m not sure exactly <em>what</em> points it&rsquo;s actually trying to make. But it sure is fun to go along for the ride.</p>\n<p>There are a few different ways to structure these kinds of movies, and this one goes for First Half: Characters and Story, Second Half: Monster Mayhem. I personally prefer the structure where the monsters are introduced from the beginning and their presence builds gradually throughout the movie until they dominate the narrative by the end, but in this case, the first-half sci-fi plot is entertaining, if convoluted. And I get why they wanted the first time you see Godzilla in the movie to be his pre-kaiju, dinosaur form. But this one goes in the file of &ldquo;Godzilla Movies That Could Have Used More Godzilla&rdquo; (see also, the first <a href=\"https://wikizilla.org/wiki/Godzilla_(2014_film)\">Monsterverse <em>Godzilla</em></a>, and <a href=\"https://wikizilla.org/wiki/Godzilla_Minus_One\"><em>Minus One</em></a>).</p>\n<p>There are a lot of engaging characters in this movie, but none of them are very deep or realized. For some reason the creepy <a href=\"https://wikizilla.org/wiki/Futurian\">white people</a> entertained me to no end, and the idea of the villains from the future (and from the past) all being weird looking white dudes I believe was intentional and related to the above-mentioned attempts at Saying Things. But man, they were creepy and campy and fun to watch.</p>\n<p>Also, that Steven Spielberg joke tried WAY too hard.</p>\n<p>A fun movie I would watch again, though it won&rsquo;t make any more sense next time, I&rsquo;m sure.</p>\n<p><strong>Rating:</strong> 3+/5<br>\n<strong>Watched:</strong> 26 February 2024</p>\n",
				"content_text": "<img src=\"uploads/2024/godzilla-vs-king-ghidorah-textless-poster.jpg\" width=\"600\" height=\"852\" alt=\"\">\n\n<i>Part of my [series of reviews](https://poetryandmadness.micro.blog/2024/05/09/godzilla-heisei-era.html) of the [Heisei era](https://wikizilla.org/wiki/Heisei_era) Godzilla movies. **Spoilers within**, but we're talking 90's Godzilla movies here. \n\nSpoiler alert: White people ruin everything. Again.</i>\n\nThis movie tried to do a lot, and while I'm not sure how much it succeeded in most of it, I can't deny it was enjoyable and engaging.\n\nThe plot is overly-complicated, and the time travel doesn't even hold up to most pop-culture time travel logical standards. The movie really wants to say _something_ about Japan's complicated relationship with 1) Godzilla, 2) the West, 3) Nuclear power; and while it does indeed Say Things about all of that... I'm not sure exactly _what_ points it's actually trying to make. But it sure is fun to go along for the ride.\n\nThere are a few different ways to structure these kinds of movies, and this one goes for First Half: Characters and Story, Second Half: Monster Mayhem. I personally prefer the structure where the monsters are introduced from the beginning and their presence builds gradually throughout the movie until they dominate the narrative by the end, but in this case, the first-half sci-fi plot is entertaining, if convoluted. And I get why they wanted the first time you see Godzilla in the movie to be his pre-kaiju, dinosaur form. But this one goes in the file of \"Godzilla Movies That Could Have Used More Godzilla\" (see also, the first [Monsterverse _Godzilla_](https://wikizilla.org/wiki/Godzilla_(2014_film)), and [_Minus One_](https://wikizilla.org/wiki/Godzilla_Minus_One)).\n\nThere are a lot of engaging characters in this movie, but none of them are very deep or realized. For some reason the creepy [white people](https://wikizilla.org/wiki/Futurian) entertained me to no end, and the idea of the villains from the future (and from the past) all being weird looking white dudes I believe was intentional and related to the above-mentioned attempts at Saying Things. But man, they were creepy and campy and fun to watch. \n\nAlso, that Steven Spielberg joke tried WAY too hard.\n\nA fun movie I would watch again, though it won't make any more sense next time, I'm sure.\n\n**Rating:** 3+/5  \n**Watched:** 26 February 2024\n",
				"date_published": "2024-05-11T11:00:00-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/05/11/godzilla-vs-king.html",
				"tags": ["reviews","Godzilla"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/05/09/just-scheduled-a.html",
				
				"content_html": "<p>Just scheduled a bunch of Godzilla movie reviews to post here over the next few weeks. Now, the real challenge is trying to remember to make <em>other</em> posts in between those, lest this just turn into a Godzilla review blog&hellip; (Though there are worse fates than that&hellip;!)</p>\n",
				"content_text": "Just scheduled a bunch of Godzilla movie reviews to post here over the next few weeks. Now, the real challenge is trying to remember to make _other_ posts in between those, lest this just turn into a Godzilla review blog... (Though there are worse fates than that...!)\n",
				"date_published": "2024-05-09T10:41:21-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/05/09/just-scheduled-a.html",
				"tags": ["current status","Godzilla"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/05/09/godzilla-heisei-era.html",
				"title": "Godzilla Heisei Era Master Post!",
				"content_html": "<!-- raw HTML omitted -->\n<p>Earlier this year, I watched all the <a href=\"https://wikizilla.org/wiki/Heisei_era\">Heisei era</a> Godzilla movies as part of a bigger, less-organized desire to make my way through the entire series and a bunch of other kaiju-centric media.</p>\n<p>I&rsquo;m going to post my &ldquo;reviews&rdquo;<!-- raw HTML omitted --><!-- raw HTML omitted -->1<!-- raw HTML omitted --><!-- raw HTML omitted --> for each movie individually over the next few days, but here is my ranking for the series, with links to each review added as I post them:</p>\n<h2 id=\"heisei-godzilla-movies-ranked\">Heisei Godzilla Movies, Ranked!</h2>\n<ol>\n<li><a href=\"https://poetryandmadness.micro.blog/2024/05/18/godzilla-vs-mechagodzilla.html\"><em>Godzilla vs Mechagodzilla 2</em></a></li>\n<li><em>Godzilla vs Destoroyah</em></li>\n<li><em>Godzilla vs Biollante</em></li>\n<li><em>Return of Godzilla</em></li>\n<li><a href=\"https://poetryandmadness.micro.blog/2024/05/11/godzilla-vs-king.html\"><em>Godzilla vs King Ghidorah</em></a></li>\n<li><em>Godzilla vs Spacegodzilla</em></li>\n<li><a href=\"https://poetryandmadness.micro.blog/2024/05/14/godzilla-and-mothra.html\"><em>Godzilla and Mothra: Battle for Earth</em></a></li>\n</ol>\n<hr>\n<p><!-- raw HTML omitted -->1. These aren&rsquo;t really reviews, more like the kind of excited, rambling nonsense I&rsquo;d likely spew from the backseat on the way home if you were unfortunate enough to take me out to the movie theater.<!-- raw HTML omitted -->↩<!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "<figure>\n  <img src=\"uploads/2024/heisei-godzilla-by-cheungchungtat.jpg\" width=\"600\" height=\"525\" alt=\"A digital painting of Heisei era Godzilla, by Cheung Chung Tat\">\n  <figcaption>\n    <a href=\"https://www.deviantart.com/cheungchungtat/art/Heisei-Godzilla-352767660\">Heisei Godzilla</a> by <a href=\"https://www.deviantart.com/cheungchungtat\">Cheung Chung Tat</a>\n  </figcaption>\n</figure>\n\nEarlier this year, I watched all the [Heisei era](https://wikizilla.org/wiki/Heisei_era) Godzilla movies as part of a bigger, less-organized desire to make my way through the entire series and a bunch of other kaiju-centric media.\n\nI'm going to post my \"reviews\"<sup><a href=\"#fn1\" id=\"ref1\">1</a></sup> for each movie individually over the next few days, but here is my ranking for the series, with links to each review added as I post them:\n\n## Heisei Godzilla Movies, Ranked!\n1. [_Godzilla vs Mechagodzilla 2_](https://poetryandmadness.micro.blog/2024/05/18/godzilla-vs-mechagodzilla.html)\n2. _Godzilla vs Destoroyah_\n3. _Godzilla vs Biollante_\n4. _Return of Godzilla_\n5. [_Godzilla vs King Ghidorah_](https://poetryandmadness.micro.blog/2024/05/11/godzilla-vs-king.html)\n6. _Godzilla vs Spacegodzilla_\n7. [_Godzilla and Mothra: Battle for Earth_](https://poetryandmadness.micro.blog/2024/05/14/godzilla-and-mothra.html)\n\n***\n<sup id=\"fn1\">1. These aren't really reviews, more like the kind of excited, rambling nonsense I'd likely spew from the backseat on the way home if you were unfortunate enough to take me out to the movie theater.<a href=\"#ref1\" title=\"Jump back to footnote 1 in the text.\">↩</a></sup>\n",
				"date_published": "2024-05-09T08:57:39-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/05/09/godzilla-heisei-era.html",
				"tags": ["Godzilla"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/05/06/taking-thursday-and.html",
				
				"content_html": "<p>Taking Thursday and Friday off of work. Why do the vacation-shortened work weeks feel longer than the full-size ones?</p>\n<p>(Probably a bad sign that the work week already feels too long, and I haven&rsquo;t actually started the first day of it yet&hellip;)</p>\n",
				"content_text": "Taking Thursday and Friday off of work. Why do the vacation-shortened work weeks feel longer than the full-size ones?\n\n(Probably a bad sign that the work week already feels too long, and I haven't actually started the first day of it yet...)\n",
				"date_published": "2024-05-06T07:14:54-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/05/06/taking-thursday-and.html",
				"tags": ["current status"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/05/03/blogs-all-the.html",
				"title": "Blogs All The Way Down! Blogs Forever and Forever 100 Years!",
				"content_html": "<p>I&rsquo;m not on Tumblr much anymore. Both for Tumblr/social media-y reasons, and for personal ones, but all of them in some way intersect with the concepts of how I spend my time, and how to be more deliberate in doing so.</p>\n<p>I&rsquo;ve been really into the idea of the <a href=\"https://indieweb.org/IndieWeb\">Indie Web</a> lately, which is a &ldquo;<em>movement</em>&rdquo; but also, more broadly, seems to be a lot of people asking the same sort of questions I&rsquo;ve had for a long time: What is it like to be an average person who wants to express themselves on the internet in This Modern Age? How can people utilize the social, artistic, and documentary strengths of this sort of technology while avoiding everything else that is gross, shallow, and commodifying about the modern web?</p>\n<p>Turns out, a lot of folks are just bloggin' it up old school style. I&rsquo;ve been spending a lot of time on various personal webpages, those with frequently-updated blogs, or slow-growing digital gardens, and more. I&rsquo;ve had my own versions of these kinds of sites for quite a while, usually built by hand, but always as an effectively private, inconsistent side-project, never knowing how or if to try and connect/project/broadcast in a broader way.</p>\n<p>I am feeling so moved now. I used to think of these kind of personal sites (of mine, at least) as time capsules to be stumbled upon, like discovering someone&rsquo;s old journals at an estate sale. And while I still think that can be true (and is incredibly interesting and worthy as an outcome), I am starting to see new (well actually, <em>old</em>) modes of expression, communication, and community-building slowly snaking vines and roots throughout the current mainstream web.</p>\n<p>Having a blog that literally no one is currently looking at is freeing, and also at times soul-crushingly pointless. But who will care what I have to say, right? Reading so many other personal, unfiltered, raw blogs and pages has reminded me that the beauty is in the mundane. The beauty is in the telling and and the seeing. Not necessarily, or exclusively, in what is being told or what is being seen.</p>\n<p>Lately I&rsquo;ve been haphazardly posting on my web blog, but that site wasn&rsquo;t connected to any sort of &ldquo;discovery&rdquo; system or larger platform. For a while, that was what I liked about it.  But that&rsquo;s changing. I&rsquo;m still way too self-conscious about all of this to just send someone a URL and ask them to check it out. But I realize I <em>am</em> interested in other people seeing what I post, and engaging with it. There are a few different communities and platforms around now where folks can easily and un-algorithmically bop around and discover other blogs and follow them. But those are still Platforms. And Communities. And the whole reason I&rsquo;ve been rolling my own homepage and blog is to avoid throwing in with any singular place that can change the rules of the game at any time. <!-- raw HTML omitted --><!-- raw HTML omitted -->1<!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n<p>And while I don&rsquo;t blog on Tumblr, I do have some followers (somehow) and, as I get braver and more public-facing about posting, I&rsquo;d want them to see what I&rsquo;m putting out. Even if it is just about <a href=\"https://poetryandmadness.micro.blog/2024/04/29/unexpected-song.html\">showtune-induced ennui</a>&hellip;</p>\n<p>I&rsquo;d like to experiment with the concept of syndication. Not like an RSS feed (though obviously those exist and I utilize them) but the concept of <a href=\"https://indieweb.org/POSSE\">POSSE</a>: <!-- raw HTML omitted -->P<!-- raw HTML omitted -->ublish (on your) <!-- raw HTML omitted -->O<!-- raw HTML omitted -->wn <!-- raw HTML omitted -->S<!-- raw HTML omitted -->ite, <!-- raw HTML omitted -->S<!-- raw HTML omitted -->yndicate <!-- raw HTML omitted -->E<!-- raw HTML omitted -->lsewhere.</p>\n<p>Because how do you choose just one &ldquo;home&rdquo;? More to the point <em>why</em> should you choose just one?</p>\n<p>POSSE type syndication seems to be the answer to all of this. I can post on a blog that I control, but syndicate wherever else I might be interested in. Maybe those syndicated channels have a life of their own, connected to their specific platforms and communities. Maybe those channels serve more as a path back to my self-hosted stuff. Either way, it&rsquo;s an interesting concept that I am excited to play around with.</p>\n<p>The thing is, syndication like I envision it would either require manually reposting, or building some Weird Dread Apparatus, frankenstein-ing all these disparate parts together. And while part of me is hunched over my keyboard, rubbing hands together with nerdy glee and quietly cackling to myself, <em>Yes, yessssss&hellip;</em> at the prospect of building such a thing, that&rsquo;s also a large undertaking while I&rsquo;m still very much in the exploratory phase. Plus, I have a habit of going all in on <em>building</em> something online, then lose the momentum when it comes to actually <em>using</em> it.</p>\n<p>So I&rsquo;ve decided to split the difference, and move my current, somewhat-rickety blog over to <a href=\"https://micro.blog/\">Micro.blog</a>), and use that to crosspost to Tumblr - while I also vet and explore other communities and platforms to syndicate to. I&rsquo;m really impressed with Micro.blog so far. Because the whole things runs on <a href=\"https://gohugo.io/\">Hugo</a>, a nerd like me has plenty of fine-tuned control and opportunities for customization - so I can still scratch that &ldquo;building and tweaking things&rdquo; itch - but the nuts and bolts of deployment and hosting are taken care of. In just a couple of days exploring and fiddling with Micro, it has resolved every major and minor inconvenience I experienced with my old stack. And I&rsquo;ve still got a lot of tinkering to do, but that is my favorite part.</p>\n<p>So depending on where you are reading this, you may see a footer at the end of the post informing you that this has been syndicated from my homebase web blog of <a href=\"https://poetryandmadness.micro.blog/\">Scrap of Poetry and Madness</a>. Engage with all of this however you like. Ignore it at your will.</p>\n<p>Most importantly, consider how <strong>you</strong> are expressing yourself online. Do you wish there were better ways than just social media? There are, my friend, there are.</p>\n<!-- raw HTML omitted -->",
				"content_text": "I'm not on Tumblr much anymore. Both for Tumblr/social media-y reasons, and for personal ones, but all of them in some way intersect with the concepts of how I spend my time, and how to be more deliberate in doing so.\n\nI've been really into the idea of the [Indie Web](https://indieweb.org/IndieWeb) lately, which is a \"_movement_\" but also, more broadly, seems to be a lot of people asking the same sort of questions I've had for a long time: What is it like to be an average person who wants to express themselves on the internet in This Modern Age? How can people utilize the social, artistic, and documentary strengths of this sort of technology while avoiding everything else that is gross, shallow, and commodifying about the modern web?\n\n<!--more-->\n\nTurns out, a lot of folks are just bloggin' it up old school style. I've been spending a lot of time on various personal webpages, those with frequently-updated blogs, or slow-growing digital gardens, and more. I've had my own versions of these kinds of sites for quite a while, usually built by hand, but always as an effectively private, inconsistent side-project, never knowing how or if to try and connect/project/broadcast in a broader way. \n\nI am feeling so moved now. I used to think of these kind of personal sites (of mine, at least) as time capsules to be stumbled upon, like discovering someone's old journals at an estate sale. And while I still think that can be true (and is incredibly interesting and worthy as an outcome), I am starting to see new (well actually, _old_) modes of expression, communication, and community-building slowly snaking vines and roots throughout the current mainstream web.\n\nHaving a blog that literally no one is currently looking at is freeing, and also at times soul-crushingly pointless. But who will care what I have to say, right? Reading so many other personal, unfiltered, raw blogs and pages has reminded me that the beauty is in the mundane. The beauty is in the telling and and the seeing. Not necessarily, or exclusively, in what is being told or what is being seen.\n\nLately I've been haphazardly posting on my web blog, but that site wasn't connected to any sort of \"discovery\" system or larger platform. For a while, that was what I liked about it.  But that's changing. I'm still way too self-conscious about all of this to just send someone a URL and ask them to check it out. But I realize I _am_ interested in other people seeing what I post, and engaging with it. There are a few different communities and platforms around now where folks can easily and un-algorithmically bop around and discover other blogs and follow them. But those are still Platforms. And Communities. And the whole reason I've been rolling my own homepage and blog is to avoid throwing in with any singular place that can change the rules of the game at any time. <sup><a href=\"#fn1\" id=\"ref1\">1</a></sup>\n\nAnd while I don't blog on Tumblr, I do have some followers (somehow) and, as I get braver and more public-facing about posting, I'd want them to see what I'm putting out. Even if it is just about [showtune-induced ennui](https://poetryandmadness.micro.blog/2024/04/29/unexpected-song.html)...\n\nI'd like to experiment with the concept of syndication. Not like an RSS feed (though obviously those exist and I utilize them) but the concept of [POSSE](https://indieweb.org/POSSE): <b>P</b>ublish (on your) <b>O</b>wn <b>S</b>ite, <b>S</b>yndicate <b>E</b>lsewhere. \n\nBecause how do you choose just one \"home\"? More to the point _why_ should you choose just one? \n\nPOSSE type syndication seems to be the answer to all of this. I can post on a blog that I control, but syndicate wherever else I might be interested in. Maybe those syndicated channels have a life of their own, connected to their specific platforms and communities. Maybe those channels serve more as a path back to my self-hosted stuff. Either way, it's an interesting concept that I am excited to play around with.\n\nThe thing is, syndication like I envision it would either require manually reposting, or building some Weird Dread Apparatus, frankenstein-ing all these disparate parts together. And while part of me is hunched over my keyboard, rubbing hands together with nerdy glee and quietly cackling to myself, _Yes, yessssss..._ at the prospect of building such a thing, that's also a large undertaking while I'm still very much in the exploratory phase. Plus, I have a habit of going all in on _building_ something online, then lose the momentum when it comes to actually _using_ it. \n\nSo I've decided to split the difference, and move my current, somewhat-rickety blog over to [Micro.blog](https://micro.blog/)), and use that to crosspost to Tumblr - while I also vet and explore other communities and platforms to syndicate to. I'm really impressed with Micro.blog so far. Because the whole things runs on [Hugo](https://gohugo.io/), a nerd like me has plenty of fine-tuned control and opportunities for customization - so I can still scratch that \"building and tweaking things\" itch - but the nuts and bolts of deployment and hosting are taken care of. In just a couple of days exploring and fiddling with Micro, it has resolved every major and minor inconvenience I experienced with my old stack. And I've still got a lot of tinkering to do, but that is my favorite part.\n\nSo depending on where you are reading this, you may see a footer at the end of the post informing you that this has been syndicated from my homebase web blog of [Scrap of Poetry and Madness](https://poetryandmadness.micro.blog/). Engage with all of this however you like. Ignore it at your will. \n\nMost importantly, consider how **you** are expressing yourself online. Do you wish there were better ways than just social media? There are, my friend, there are.\n\n<hr>\n<sup id=\"fn1\">1. Not that the personal homepage/blogging platforms I'm thinking of here seem to be in danger of doing that. But still. When someone else ultimately holds the keys to the platform, they hold the keys to your content, and in some ways to your voice.<a href=\"#ref1\" title=\"Jump back to footnote 1 in the text.\">↩</a></sup>\n\n",
				"date_published": "2024-05-03T12:05:49-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/05/03/blogs-all-the.html",
				"tags": ["meta"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/05/02/steadily-reaching-the.html",
				
				"content_html": "<p>Steadily reaching the point of transition between <em>setting up</em> a new digital space/tool/platform and actually <em>using it</em> as a practice. Fully disclosure: I often struggle to make this transition well&hellip;</p>\n",
				"content_text": "Steadily reaching the point of transition between _setting up_ a new digital space/tool/platform and actually _using it_ as a practice. Fully disclosure: I often struggle to make this transition well...\n",
				"date_published": "2024-05-02T20:31:33-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/05/02/steadily-reaching-the.html",
				"tags": ["current status"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/05/01/ysabeau-has-been.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<p><em>Ysabeau</em> 🐈 <em>has been known to let it all hang out on sunny days&hellip;</em><br>\n30 April 2024</p>\n",
				"content_text": "<img src=\"https://poetryandmadness.micro.blog/uploads/2024/ysabeauiscomfy.jpeg\" width=\"600\" height=\"600\" alt=\"Ysabeau the cat reclines, belly up, in the sun. Her back legs are spread and she looks content, but also slightly annoyed at having her picture taken.\">\n\n_Ysabeau_ 🐈 _has been known to let it all hang out on sunny days..._  \n30 April 2024\n\n",
				"date_published": "2024-05-01T16:00:03-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/05/01/ysabeau-has-been.html",
				"tags": ["photos","Ysabeau"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/05/01/tulips-april.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<p><em>Tulips</em> 🌱🌷<br>\n28 April 2018</p>\n",
				"content_text": "<img src=\"https://poetryandmadness.micro.blog/uploads/2024/tulips.jpeg\" width=\"449\" height=\"600\" alt=\"A close up of two tulips, one dark orange, another a pastel yellow. The yellow tulip's petals have fringy, shaggy edges with pink highlights.\">\n\n_Tulips_ 🌱🌷  \n28 April 2018\n",
				"date_published": "2024-05-01T15:32:25-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/05/01/tulips-april.html",
				"tags": ["photos"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/05/01/everyday-i-am.html",
				
				"content_html": "<p>Every day I&hellip;.</p>\n<p>     <!-- raw HTML omitted -->am hustlin'<!-- raw HTML omitted --> <br>\n     <!-- raw HTML omitted -->have the blues<!-- raw HTML omitted --> <br>\n     <!-- raw HTML omitted -->write the book<!-- raw HTML omitted --><br>\n     have to look up the difference between &ldquo;i.e.&rdquo; and &ldquo;e.g.&rdquo;&hellip;</p>\n",
				"content_text": "Every day I....\n\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<s>am hustlin'</s>    \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<s>have the blues</s>    \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<s>write the book</s>  \n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;have to look up the difference between \"i.e.\" and \"e.g.\"...\n",
				"date_published": "2024-05-01T11:18:01-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/05/01/everyday-i-am.html"
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/04/30/migrating-over-to.html",
				
				"content_html": "<p>Migrating over to micro blog and realizing it has solved every major and minor annoyance I was experiencing on my old platform/stack&hellip;</p>\n<p>#currently</p>\n",
				"content_text": "Migrating over to micro blog and realizing it has solved every major and minor annoyance I was experiencing on my old platform/stack...\n\n\\#currently\n",
				"date_published": "2024-04-30T18:54:48-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/04/30/migrating-over-to.html",
				"tags": ["current status","meta"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/04/30/morning-computer.html",
				"title": "morning computer 007",
				"content_html": "<blockquote>\n<p>When you drop all ideas about pleasure causing happiness and pain causing suffering, then you can find happiness where you might expect to feel pain and you can see how certain pleasures can lead to certain suffering. When you pay attention to your actual feelings rather than what you might expect to feel, you will surprise yourself.</p>\n</blockquote>\n<p>💬 Source: <a href=\"https://purplebuddhaproject.tumblr.com/post/94185857465/pleasure-pain-and-happiness\">Pleasure, Pain and Happiness</a></p>\n",
				"content_text": "> When you drop all ideas about pleasure causing happiness and pain causing suffering, then you can find happiness where you might expect to feel pain and you can see how certain pleasures can lead to certain suffering. When you pay attention to your actual feelings rather than what you might expect to feel, you will surprise yourself.\n\n💬 Source: [Pleasure, Pain and Happiness](https://purplebuddhaproject.tumblr.com/post/94185857465/pleasure-pain-and-happiness)\n\n",
				"date_published": "2024-04-30T06:46:12-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/04/30/morning-computer.html",
				"tags": ["morning computer","quotes"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/04/29/unexpected-song.html",
				"title": "Unexpected Song",
				"content_html": "<p>Listening to musicals still makes me sad sometimes. Especially some musicals, and especially some times. It&rsquo;s been nearly twenty years since that part of my life. I never fully closed the door to that part of me, but it&rsquo;s also a room I can&rsquo;t go into completely. It&rsquo;s a room I don&rsquo;t think I&rsquo;ll ever fully inhabit again. And yet.</p>\n<p>Shelves of scripts I&rsquo;ll never give away. Soundtracks moved from device to device that I can&rsquo;t listen to anymore. Boxes of programs and cast party souvenirs in the attic.</p>\n<p>It&rsquo;s cliche to say this, but it was a lifetime ago.  I think back to that period and it&rsquo;s not unfamiliar but it is foreign. Like walking through your childhood home and realizing you aren&rsquo;t in a memory but in a dream that&rsquo;s slowly melting into a nightmare.</p>\n<p>But the nightmare isn&rsquo;t now, it was back then, when I violently ripped out that page from my life and tossed it to the wind. Only later realizing there were words on the page I&rsquo;d never see again, never stumble across and only sometimes be able to remember the vague shapes of. Words that were so important to me not just lost but discarded. A secret formula, a spell, a code, a key. Gone.</p>\n<p>At the time, I thought my love of theatre defined me. I couldn&rsquo;t imagine myself or my life without that as the foundation. What does that mean now, for the things I see around me that I cling to? The stuff I surround myself with that I hang my identity on?</p>\n<p>Maybe its encouraging, empowering even. That part of my life is gone, and yet I remain. Completely different and exactly the same.</p>\n<p>There was so much more violently lost back then than just my connection to the stage. So much more pain caused and endured. And yet most of those scars have healed over and I am stronger for it. Leaner. Smarter.</p>\n<p>But there was such potential then. I was just starting something, intoxicated with the potential of it all, and I drunkenly wrapped my life around a lamp post. The wounds healed. Relationships irrevocably lost, but hearts grew back. I am better for that time in my life. Much didn&rsquo;t survive the transition. Much did and is stronger as a result. But in between, or maybe holding it all together is&hellip; theatre. That life of mine, just getting started, never to resolve.</p>\n<p>Hanging in the air. A ghost light on stage waiting for the next show that will never come. But at least the theater is never truly dark.</p>\n<hr>\n<p><em>This melancholia brought to you by:</em></p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Listening to musicals still makes me sad sometimes. Especially some musicals, and especially some times. It's been nearly twenty years since that part of my life. I never fully closed the door to that part of me, but it's also a room I can't go into completely. It's a room I don't think I'll ever fully inhabit again. And yet.\n\nShelves of scripts I'll never give away. Soundtracks moved from device to device that I can't listen to anymore. Boxes of programs and cast party souvenirs in the attic.\n\nIt's cliche to say this, but it was a lifetime ago.  I think back to that period and it's not unfamiliar but it is foreign. Like walking through your childhood home and realizing you aren't in a memory but in a dream that's slowly melting into a nightmare.\n\nBut the nightmare isn't now, it was back then, when I violently ripped out that page from my life and tossed it to the wind. Only later realizing there were words on the page I'd never see again, never stumble across and only sometimes be able to remember the vague shapes of. Words that were so important to me not just lost but discarded. A secret formula, a spell, a code, a key. Gone.\n\nAt the time, I thought my love of theatre defined me. I couldn't imagine myself or my life without that as the foundation. What does that mean now, for the things I see around me that I cling to? The stuff I surround myself with that I hang my identity on? \n\nMaybe its encouraging, empowering even. That part of my life is gone, and yet I remain. Completely different and exactly the same.\n\nThere was so much more violently lost back then than just my connection to the stage. So much more pain caused and endured. And yet most of those scars have healed over and I am stronger for it. Leaner. Smarter. \n\nBut there was such potential then. I was just starting something, intoxicated with the potential of it all, and I drunkenly wrapped my life around a lamp post. The wounds healed. Relationships irrevocably lost, but hearts grew back. I am better for that time in my life. Much didn't survive the transition. Much did and is stronger as a result. But in between, or maybe holding it all together is... theatre. That life of mine, just getting started, never to resolve.  \n\nHanging in the air. A ghost light on stage waiting for the next show that will never come. But at least the theater is never truly dark.\n\n***\n\n_This melancholia brought to you by:_\n\n<iframe style=\"border-radius:12px\" src=\"https://open.spotify.com/embed/track/3R6CcJRNGiQanFkO8D4gMa?utm_source=generator\" width=\"100%\" height=\"152\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe>\n",
				"date_published": "2024-04-29T21:35:05-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/04/29/unexpected-song.html"
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/04/10/journal-excerpt.html",
				"title": "Journal Excerpt",
				"content_html": "<p>&hellip;wandering forward, sometimes only by inches. But I am moving. And so is everything else. I will never truly get to pause everything and have a proper look around to get my bearings. But I can keep dropping pages like breadcrumbs as I go, and following the marks on the trunks of trees left before me, and keep chasing the sunlight I see streaming through the trees ahead.</p>\n<p>And that will be enough.</p>\n<p><em>From a journal entry dated 10 April 2024</em></p>\n",
				"content_text": "...wandering forward, sometimes only by inches. But I am moving. And so is everything else. I will never truly get to pause everything and have a proper look around to get my bearings. But I can keep dropping pages like breadcrumbs as I go, and following the marks on the trunks of trees left before me, and keep chasing the sunlight I see streaming through the trees ahead.\n\nAnd that will be enough.\n\n_From a journal entry dated 10 April 2024_\n\n",
				"date_published": "2024-04-10T07:26:41-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/04/10/journal-excerpt.html",
				"tags": ["journal"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/03/19/morning-computer.html",
				"title": "morning computer 006",
				"content_html": "<h3 id=\"the-ever-mutating-life-of-tumblr-dot-com\">The Ever-Mutating Life of Tumblr Dot Com</h3>\n<p><em>Okay funny story - I wrote the below little post over a year ago, and for some reason, never published it. Instead it was hiding in drafts nearly lost to history and my memory.</em></p>\n<p><em>Spoiler Alert: I did end up rejoining Tumblr, but then got back off of it around the change of the year as part of a general rejiggering of my internet/media/art-experiencing habits and routines. I do miss some aspects of Tumblr (again) but not enough to got back&hellip;</em></p>\n<p><em>Anyway, original year-old post follows:</em></p>\n<blockquote>\n<p>As a service, Tumblr’s lack of commerciality and consistent inability to successfully monetize itself is part of its whole appeal. There’s a whole genre of Tumblr posts that just screenshot and mock the bizarre hosted ads that spawn on the dashboard like mutated fish in a radioactively-poisoned river.</p>\n<p>But it’s a loving kind of mockery—users seem, for the most part, to be genuinely grateful for the state of the site. For many, it’s a refuge from the dystopian insanity that the rest of the internet has come to represent. “It’s like anti-social social media,” says Bec, regarding Tumblr’s continued paradoxical appeal.</p>\n<p>[…] for those who value creativity without the pressures of “hustle culture,” and wish to avoid the current-events performative outrage that has crept in, kudzu-like, and swallowed up almost every single other area of open expression online, Tumblr remains ideal.</p>\n<p>The corollary of that, of course, being that those who appreciate that creativity without necessarily needing or wanting to express it themselves can also find happy homes on Tumblr, as spectators to a healthy culture of simply <em>liking</em> things.</p>\n</blockquote>\n<p>Source: <a href=\"https://www.fansplaining.com/articles/the-ever-mutating-life-of-tumblr-dot-com\">The Ever Mutating Life of Tumblr dot com</a></p>\n<p>Tumblr was absolutely my social media “home” for a long time - though I never saw it has a social media platform, per se. It was communal blogging and celebration of cool shit. It was the only platform I ever amassed any sort of following on, and the only one I ever saw my self <em>wanting</em> a following on.</p>\n<p>I deleted my account and my tumblogs (hell yes, that is what I did and will aways call them) when the porn ban came down - mainly because the site/admins/corporate overlords were handling it, oh <em>so badly</em>. But it sounds like a lot of that has calmed down now…</p>\n<p>And now, I’m nostalgic for it? I am feeling… things? This will not do, not at all.</p>\n<p>I’m not considering getting back on Tumblr? …am I?</p>\n<p>Oh no.</p>\n",
				"content_text": "### The Ever-Mutating Life of Tumblr Dot Com\n\n_Okay funny story - I wrote the below little post over a year ago, and for some reason, never published it. Instead it was hiding in drafts nearly lost to history and my memory._\n\n_Spoiler Alert: I did end up rejoining Tumblr, but then got back off of it around the change of the year as part of a general rejiggering of my internet/media/art-experiencing habits and routines. I do miss some aspects of Tumblr (again) but not enough to got back..._\n\n_Anyway, original year-old post follows:_\n\n> As a service, Tumblr’s lack of commerciality and consistent inability to successfully monetize itself is part of its whole appeal. There’s a whole genre of Tumblr posts that just screenshot and mock the bizarre hosted ads that spawn on the dashboard like mutated fish in a radioactively-poisoned river.\n> \n> But it’s a loving kind of mockery—users seem, for the most part, to be genuinely grateful for the state of the site. For many, it’s a refuge from the dystopian insanity that the rest of the internet has come to represent. “It’s like anti-social social media,” says Bec, regarding Tumblr’s continued paradoxical appeal.\n> \n> […] for those who value creativity without the pressures of “hustle culture,” and wish to avoid the current-events performative outrage that has crept in, kudzu-like, and swallowed up almost every single other area of open expression online, Tumblr remains ideal.\n> \n> The corollary of that, of course, being that those who appreciate that creativity without necessarily needing or wanting to express it themselves can also find happy homes on Tumblr, as spectators to a healthy culture of simply *liking* things.\n\nSource: [The Ever Mutating Life of Tumblr dot com](https://www.fansplaining.com/articles/the-ever-mutating-life-of-tumblr-dot-com)\n\n\nTumblr was absolutely my social media “home” for a long time - though I never saw it has a social media platform, per se. It was communal blogging and celebration of cool shit. It was the only platform I ever amassed any sort of following on, and the only one I ever saw my self *wanting* a following on. \n\nI deleted my account and my tumblogs (hell yes, that is what I did and will aways call them) when the porn ban came down - mainly because the site/admins/corporate overlords were handling it, oh *so badly*. But it sounds like a lot of that has calmed down now…\n\nAnd now, I’m nostalgic for it? I am feeling… things? This will not do, not at all.\n\nI’m not considering getting back on Tumblr? …am I?\n\nOh no.\n",
				"date_published": "2024-03-19T23:16:22-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/03/19/morning-computer.html",
				"tags": ["morning computer"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/03/19/i-am-afraid.html",
				"title": "I am afraid to put dates on entries. ",
				"content_html": "<p>I am intimidated. I feel pressured by them.</p>\n<p>I understand and agree with their usefulness in the world of &lsquo;blog as archive&rsquo;, but among the other parallel worlds of what a blog can be, I kind of like the ambiguity of posting without them. Does it really matter that you know exactly what day I said this? Or, how close this is, temporally, to the previous post? To the (hopefully) next one?</p>\n<p>I mean, it might matter! I don&rsquo;t actually know! I&rsquo;m asking you!</p>\n<p>Undecided. Is there a date on this post? Depending on when you are looking at it, there might be. Or there might not. I&rsquo;m not sure if there is a third option.</p>\n<p>&ldquo;The only one among us not free to change their mind is the one who does not decide&hellip;&rdquo;</p>\n",
				"content_text": "I am intimidated. I feel pressured by them. \n\nI understand and agree with their usefulness in the world of 'blog as archive', but among the other parallel worlds of what a blog can be, I kind of like the ambiguity of posting without them. Does it really matter that you know exactly what day I said this? Or, how close this is, temporally, to the previous post? To the (hopefully) next one?\n\nI mean, it might matter! I don't actually know! I'm asking you! \n\nUndecided. Is there a date on this post? Depending on when you are looking at it, there might be. Or there might not. I'm not sure if there is a third option.\n\n\"The only one among us not free to change their mind is the one who does not decide...\"\n",
				"date_published": "2024-03-19T23:04:04-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/03/19/i-am-afraid.html"
			},
			{
				"id": "http://poetryandmadness.micro.blog/2024/03/19/soft-reboot.html",
				"title": "Soft Reboot",
				"content_html": "<p>Offline, I wrote:</p>\n<blockquote>\n<p>I’ve been spending some time, literally tonight and in general, bopping around the current, uh blogosphere. I’ve found a few sites, I believe from ooh directory that are doing basically the exact thing I could see myself doing which is… this, right now. Except in a blog instead of privately, talking to myself in Notion.</p>\n<p>Why <em>not</em> do this in a blog? Why I am here? Because I don’t think anyone will read it? I just read a bunch of random blogs. So its clearly not that hard to get it in front of some eyes.</p>\n<p>Because I don’t want to invest the effort? That’s very possible, but that’s also the kind of energy I’m trying to transform.</p>\n<p>Because…it will suck? Well probably but that’s a bad reason not to do something.</p>\n</blockquote>\n<p>And so, I&rsquo;m here. Again. For the first time. Again.</p>\n<p>I don&rsquo;t need to know how this will all go in order to do it at all. I need to keep telling myself that.</p>\n<p>Something I read tonight, from <a href=\"https://veronique.ink/daily-bloggers/\">this new personal blog I discovered</a> discussing their love of &lsquo;daily bloggers&rsquo;:</p>\n<blockquote>\n<p>I also like it when they don’t have all the answers, as prescriptive blogs aren&rsquo;t my jam. The more they write without an overactive filter, the better. It allows me to learn/discover things alongside them.</p>\n</blockquote>\n<p>That&rsquo;s&hellip; <em>facinating</em>. Because, trying to actually answer my above question of &ldquo;Why am I not just blogging?&rdquo;, I realize a large part of my hesitation to engage with blogging specifically (as opposed developing and writing more polished &ldquo;essay&rdquo; posts (which I don&rsquo;t do much either but for different (bad) reasons&hellip;)) is because I devalue what I write when I &ldquo;write without an overactive filter&rdquo;. I doesn&rsquo;t feel &ldquo;real&rdquo; and I can&rsquo;t imagine anyone would want to read it. I literally don&rsquo;t see the value in it for anyone outside of myself.</p>\n<p>&hellip;and then I think of all the time I&rsquo;ve spent reading other people&rsquo;s personal blogs and zines, and things like published diaries, notebooks, sketchbooks, etc.</p>\n<p>So yeah. I think I just need to get out of my own way and type stuff on the damn internet. And go from there.</p>\n<p>Thanks, <a href=\"https://veronique.ink/\">Veronique.ink</a>!</p>\n",
				"content_text": "Offline, I wrote:\n\n> I’ve been spending some time, literally tonight and in general, bopping around the current, uh blogosphere. I’ve found a few sites, I believe from ooh directory that are doing basically the exact thing I could see myself doing which is… this, right now. Except in a blog instead of privately, talking to myself in Notion.\n>\n> Why *not* do this in a blog? Why I am here? Because I don’t think anyone will read it? I just read a bunch of random blogs. So its clearly not that hard to get it in front of some eyes. \n>\n> Because I don’t want to invest the effort? That’s very possible, but that’s also the kind of energy I’m trying to transform.\n>\n> Because…it will suck? Well probably but that’s a bad reason not to do something.\n\nAnd so, I'm here. Again. For the first time. Again.\n\nI don't need to know how this will all go in order to do it at all. I need to keep telling myself that. \n\nSomething I read tonight, from [this new personal blog I discovered](https://veronique.ink/daily-bloggers/) discussing their love of 'daily bloggers':\n\n> I also like it when they don’t have all the answers, as prescriptive blogs aren't my jam. The more they write without an overactive filter, the better. It allows me to learn/discover things alongside them.\n\nThat's... _facinating_. Because, trying to actually answer my above question of \"Why am I not just blogging?\", I realize a large part of my hesitation to engage with blogging specifically (as opposed developing and writing more polished \"essay\" posts (which I don't do much either but for different (bad) reasons...)) is because I devalue what I write when I \"write without an overactive filter\". I doesn't feel \"real\" and I can't imagine anyone would want to read it. I literally don't see the value in it for anyone outside of myself.\n\n...and then I think of all the time I've spent reading other people's personal blogs and zines, and things like published diaries, notebooks, sketchbooks, etc.\n\nSo yeah. I think I just need to get out of my own way and type stuff on the damn internet. And go from there.\n\nThanks, [Veronique.ink](https://veronique.ink/)!\n\n\n",
				"date_published": "2024-03-19T22:50:44-06:00",
				"url": "https://poetryandmadness.micro.blog/2024/03/19/soft-reboot.html",
				"tags": ["meta"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2023/06/26/morning-computer-june.html",
				"title": "morning computer 005",
				"content_html": "<h3 id=\"eternal-return\">Eternal Return</h3>\n<blockquote>\n<p>[Nietzsche] accepts the inevitability and suffering of reality (eternal return) but insists that the person, the self, must change perception. This change of perception must address only oneself, for no other expectation or altered circumstance but only sheer will, insight, and perception, can give us a new ability to understand, tolerate, and transcend suffering. <strong>The present moment of existence must become the tablet on which to etch one’s aspirations, intentions, conclusions, directions, not change any external circumstances but to see through everything, to live in its contradictions.</strong> [Emphasis mine.]</p>\n</blockquote>\n<blockquote>\n<p>Eternal return is purgation of past weaknesses, failure, error, desire. The self must embrace not only the will to pursue a new self but what would be associated with Nietzsche as the will to power, meaning no more than the taking control of one’s self in life and destiny. Because this self-made destiny is the fruit of a personal struggle, the self must overcome much that is irrevocably external affecting the inner person. The will must transform the self not through attack but through transvaluation, the will overcoming obstacles, subjectivities, falsehoods, not reliant on society, culture, others, but forging one’s own path and system of thought and values.</p>\n</blockquote>\n<p>From: <a href=\"https://www.hermitary.com/thatch/?p=2330\">Eternal Return</a> via <a href=\"https://www.hermitary.com/thatch/\">Hermit&rsquo;s Thatch</a></p>\n<p>Once again I&rsquo;ve been thinking about eternal return (heh).</p>\n<p>Once again I find myself circling, hovering around the periphery of action.</p>\n<p>Once again I find myself going through all of the motions and preparations leading up to an actual change. I make the run up closer than I ever have.</p>\n<p>Yet still the gulf remains. The gap. The canyon between me and It.</p>\n<p>I have been at this point so many times before.</p>\n<p>I just need a better approach, I say. So I retreat back. I plan the route. I clear the path. I wait for favorable weather. The wheel turns again; I set off running. It&rsquo;s easier this time, I am gaining speed. I see the Other Side. I see where I can land. I just need to jump, and&hellip;</p>\n<p>And I skid to a stop, right at the edge. Again.</p>\n<p>It is easy to get lost in that. Here I am making the same old mistakes. Here I am again, not doing the thing I claim I want to do.</p>\n<p>The gravity of my goal, my task, has no doubt captured me. But I can&rsquo;t come into land. I simply spiral tighter and tighter around it. And sometimes I drift away and maybe that&rsquo;s what I need - to let it go and float off somewhere else - but no, at the farthest reaches, the arch of orbit tugs at my back, my retreat slows, and my path bends and I am on the approach again.</p>\n<p>How many times will I do this?</p>\n<p>But to think that this isn&rsquo;t yet another repeat of every other failed attempt&hellip; to realize that I am not being cursed with another frustrating iteration, but blessed with another chance to get it right&hellip;</p>\n<p>&hellip;that despite how many times I have found myself here, the only thing that exists is this present moment&hellip;</p>\n<p>&ldquo;&hellip;the person, the self, must change perception.&rdquo;</p>\n",
				"content_text": "### Eternal Return\n\n> [Nietzsche] accepts the inevitability and suffering of reality (eternal return) but insists that the person, the self, must change perception. This change of perception must address only oneself, for no other expectation or altered circumstance but only sheer will, insight, and perception, can give us a new ability to understand, tolerate, and transcend suffering. **The present moment of existence must become the tablet on which to etch one’s aspirations, intentions, conclusions, directions, not change any external circumstances but to see through everything, to live in its contradictions.** [Emphasis mine.]\n\n> Eternal return is purgation of past weaknesses, failure, error, desire. The self must embrace not only the will to pursue a new self but what would be associated with Nietzsche as the will to power, meaning no more than the taking control of one’s self in life and destiny. Because this self-made destiny is the fruit of a personal struggle, the self must overcome much that is irrevocably external affecting the inner person. The will must transform the self not through attack but through transvaluation, the will overcoming obstacles, subjectivities, falsehoods, not reliant on society, culture, others, but forging one’s own path and system of thought and values. \n\nFrom: [Eternal Return](https://www.hermitary.com/thatch/?p=2330) via [Hermit's Thatch](https://www.hermitary.com/thatch/)\n\nOnce again I've been thinking about eternal return (heh).\n\nOnce again I find myself circling, hovering around the periphery of action. \n\nOnce again I find myself going through all of the motions and preparations leading up to an actual change. I make the run up closer than I ever have. \n\nYet still the gulf remains. The gap. The canyon between me and It.\n\nI have been at this point so many times before. \n\nI just need a better approach, I say. So I retreat back. I plan the route. I clear the path. I wait for favorable weather. The wheel turns again; I set off running. It's easier this time, I am gaining speed. I see the Other Side. I see where I can land. I just need to jump, and...\n\nAnd I skid to a stop, right at the edge. Again.\n\nIt is easy to get lost in that. Here I am making the same old mistakes. Here I am again, not doing the thing I claim I want to do.\n\nThe gravity of my goal, my task, has no doubt captured me. But I can't come into land. I simply spiral tighter and tighter around it. And sometimes I drift away and maybe that's what I need - to let it go and float off somewhere else - but no, at the farthest reaches, the arch of orbit tugs at my back, my retreat slows, and my path bends and I am on the approach again.\n\nHow many times will I do this?\n\nBut to think that this isn't yet another repeat of every other failed attempt... to realize that I am not being cursed with another frustrating iteration, but blessed with another chance to get it right...\n\n...that despite how many times I have found myself here, the only thing that exists is this present moment...\n\n\"...the person, the self, must change perception.\"\n\n\n\n\n\n \n\n\n\n",
				"date_published": "2023-06-26T15:25:21-06:00",
				"url": "https://poetryandmadness.micro.blog/2023/06/26/morning-computer-june.html",
				"tags": ["morning computer","quotes"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2023/02/24/morning-computer-feb.html",
				"title": "morning computer 004",
				"content_html": "<h3 id=\"who-are-we-really\">Who Are We, Really?</h3>\n<blockquote>\n<p>Sometimes, alone, I feel like a ghost. Unmasked, I walk through the world <strong>as if I’m embodying impressions.</strong> I channel the wind, the sadness the rain brings, the spring gloom. My identity is composed of memories, of spirits of places, of things I tell myself, and of things others tell me. I know it’s all in flux. The masks are shifting.</p>\n</blockquote>\n<p>…this reminds me of:</p>\n<blockquote>\n<p>Miles walking, the sound of breaking waves the other side of me,\nPaumanok there and then as I thought the old thought of likenesses,\nThese you presented to me you fish-shaped island,\nAs I wended the shores I know,\n<strong>As I walk’d with that electric self seeking types.</strong></p>\n</blockquote>\n<p>💬 from <a href=\"https://www.poetryfoundation.org/poems/51003/as-i-ebbd-with-the-ocean-of-life\">Walt Whitman’s “As I Ebb’d With The Ocean of Life”</a></p>\n<blockquote>\n<p>In times of crisis, we set out to find ourselves. Perhaps we will find whatever it is that constitutes <em>us</em> out there in the Himalayas, or somewhere out west. Perhaps we’ll find ourselves in another person who teaches us to see, or in the sun that sets over the Pacific ocean. Often we’ll gain access to another part of ourselves through a story that inspires us.</p>\n<p>But this quest to “find yourself” is somewhat self-defeating when the more precise goal ought to be “to create yourself,”</p>\n</blockquote>\n<p><em>Discovery:</em> Searching for a fixed point; you can miss it, never find it</p>\n<p><em>Creation:</em> Always happening, and especially when you realize it, and do with intention. Never has to end. Is complete when you say so…</p>\n<blockquote>\n<p>In Hinduism, the ego is a trapping of the physical world. The body is often likened to a flesh tomb, and the ego is like <strong>the glass that contains our true self and shapes it</strong>. The true self—the <em>atman</em> —is a silent, conscious witness. It exists within every creature at its core.</p>\n</blockquote>\n<p>I really enjoyed this piece, and find myself returning to it. I’ve read it two or three times already, and though it doesn’t necessarily contain any revolutionary, knock-me-off-my-chair epiphanies, it does that amazing and crucial task of giving form and structure to the kind of wordless questions and wonderings I often have, and allows me to re-engage with them, chew on them in more tangible forms than when they are swimming in my head…</p>\n<p>Source: <a href=\"https://www.cunning-folk.com/read-posts/who-are-we-really-and-who-can-we-become\">Who Are We Really?</a></p>\n",
				"content_text": "### Who Are We, Really?\n\n> Sometimes, alone, I feel like a ghost. Unmasked, I walk through the world **as if I’m embodying impressions.** I channel the wind, the sadness the rain brings, the spring gloom. My identity is composed of memories, of spirits of places, of things I tell myself, and of things others tell me. I know it’s all in flux. The masks are shifting.\n\n…this reminds me of:\n\n> Miles walking, the sound of breaking waves the other side of me,\n> Paumanok there and then as I thought the old thought of likenesses,\n> These you presented to me you fish-shaped island,\n> As I wended the shores I know,\n> **As I walk’d with that electric self seeking types.**\n\n💬 from [Walt Whitman’s “As I Ebb’d With The Ocean of Life”](https://www.poetryfoundation.org/poems/51003/as-i-ebbd-with-the-ocean-of-life)\n\n> In times of crisis, we set out to find ourselves. Perhaps we will find whatever it is that constitutes *us* out there in the Himalayas, or somewhere out west. Perhaps we’ll find ourselves in another person who teaches us to see, or in the sun that sets over the Pacific ocean. Often we’ll gain access to another part of ourselves through a story that inspires us.\n> \n> But this quest to “find yourself” is somewhat self-defeating when the more precise goal ought to be “to create yourself,”\n\n_Discovery:_ Searching for a fixed point; you can miss it, never find it\n\n_Creation:_ Always happening, and especially when you realize it, and do with intention. Never has to end. Is complete when you say so…\n\n> In Hinduism, the ego is a trapping of the physical world. The body is often likened to a flesh tomb, and the ego is like **the glass that contains our true self and shapes it**. The true self—the *atman* —is a silent, conscious witness. It exists within every creature at its core.\n\nI really enjoyed this piece, and find myself returning to it. I’ve read it two or three times already, and though it doesn’t necessarily contain any revolutionary, knock-me-off-my-chair epiphanies, it does that amazing and crucial task of giving form and structure to the kind of wordless questions and wonderings I often have, and allows me to re-engage with them, chew on them in more tangible forms than when they are swimming in my head…\n\nSource: [Who Are We Really?](https://www.cunning-folk.com/read-posts/who-are-we-really-and-who-can-we-become)\n\n",
				"date_published": "2023-02-24T10:59:01-06:00",
				"url": "https://poetryandmadness.micro.blog/2023/02/24/morning-computer-feb.html",
				"tags": ["morning computer","quotes"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2023/02/22/doldrums-defied-a.html",
				"title": "Doldrums Defied: A January Recap",
				"content_html": "<p><strong>January lasted about 37 days.</strong> It wasn&rsquo;t a bad month, but it was a long month. 2023 has come in like&hellip; a&hellip; Do we even have anything to compare to anymore? Whatever it was, here is how the start of 2023 went for me:</p>\n<h2 id=\"aloy\">Aloy</h2>\n<p><strong>The month started off with a discovery: Aloy, our kitten 🐈, Champion of the Nora, Savior of Meridian, was&hellip; a boy.</strong> We got Aloy (yes, named after <em>that</em> <a href=\"https://horizon.fandom.com/wiki/Aloy\">Aloy</a>)in late October when they were about two months old. We were told they were female, and had no reason to question that. Since then, three different vets and who-knows-how-many vet techs examined this cat, but it was only as they were literally about to spay her that they realized, hold on, that&rsquo;s a penis.</p>\n<p>Our vet called us from the operation, moments before the first cut, and she was so embarrassed. We weren&rsquo;t mad at all, but we were&hellip; surprised. So, Aloy got neutered instead and we had to re-learn our cat&rsquo;s pronouns.</p>\n<p>Aloy the Boy got to keep his name, lost his balls, and gained&hellip; a cone.</p>\n<p>Oh God, the cone. Could one apparatus simultaneously confer such shame, confusion, rage, humiliation, helplessness, and desperation upon its wearer as this cone did to poor Aloy? The looks of abject sadness. The complete inability to remember how to eat in it, how to drink. The repeated, melodramatic attempts - FLIP, SIGH, PLOP - to get comfortable.</p>\n<p>Once the cone was off and new normality was established, it was time to make the basement Aloy-proof, or at least approach that impossible goal as thoroughly as we could. Since his arrival, Aloy had been restricted to roaming the first floor, and I have been working most days up there with him and D. But my office is in the basement, and I was ready to get back down there - though I didn&rsquo;t want to do so until Aloy was ready to have access to expanded territory.</p>\n<p>The basement has needed to be cleaned and severely reorganized since the Fall anyway. It wasn&rsquo;t remotely cat safe, but Aloy wasn&rsquo;t remotely cat-responsible enough to be down there, even if it was made &ldquo;safe&rdquo;, until very recently. So over the first few weeks of the month, I cleaned and prepped my office and solidified the main room down there as The Studio, half workout gym/studio for D, half craft/collage/workshop space for both of us. Frankly, the basement has probably never been this clean or organized the whole time we&rsquo;ve lived here. All it took was a tiny cat with apparently confusing genitals.</p>\n<h2 id=\"the-arch-book-etc\">The Arch-Book, etc.</h2>\n<p><strong>I&rsquo;ve been puttering around with this blog, my website, and web-related creativity on and off (more &ldquo;off&rdquo;) for a while now.</strong> It&rsquo;s been part of a larger project to pivot how I spend my time, and to engage with new and refined practices and processes. In short, I&rsquo;m trying to live a more deliberate life, spend my time the way I believe I want to, instead of the ways I happen to drift into.  This has manifested in redefining my daily routines, the devices I use, and how I use them.</p>\n<p>And somehow as part of that quest, quite randomly, I decided to make my erstwhile Chromebook an intrinsic part of that processes.</p>\n<p>I&rsquo;ve discussed <a href=\"https://write.as/poetry-and-madness/the-origin-of-the-arch-book\">elsewhere</a> the project and how unexpectedly it came to be. Basically, my MacBook is getting old, and likes to stay plugged into the wall most of the time, so I needed a device I could bring around the house with me, more focused on typing and creating content. The MacBook&rsquo;s battery has been flakey for a while, and I&rsquo;ve been working around that by just&hellip; not doing the sort of generative, creative work I claim to want to do. With the MacBook downstairs plugged in and a new cat upstairs quite literally demanding my attention, it was the perfect excuse to keep kicking the can. Until one day, I picked up the can, opened it, and out popped the peanut brittle snakes of a knotty hardware project.</p>\n<p>So for about 10 days, I spent nearly every moment of spare time learning how to install and use Linux on a machine intended to serve a purpose I have to some degree been avoiding for&hellip; twenty years? And it&rsquo;s&hellip; worked?</p>\n<p>Creating the <code>arch-book</code> and redistributing my digital life across a different arrangement of devices naturally triggered many knock-on projects, but the majority of them were all still aligned with my larger set of goals: spend my time deliberately, facilitate meaningful reading/watching/listening experiences, build creative and journalistic practices.</p>\n<p>By the end of the month, by and large the infrastructure of this part of my life is up and running. It will always be an active process; there will be endless tweaking (both with Linux, and my life), but so far the maintenance hasn&rsquo;t over-shadowed the actual work I want to get done. The <code>arch-book</code> sits right in the middle of all of this, and besides being an important cog, and a valuable tech project&hellip; it&rsquo;s just damn fun to use.</p>\n<h2 id=\"building-creating-etc\">Building, Creating, etc.</h2>\n<p><strong>I&rsquo;ve been more active on this blog, comparatively speaking.</strong> Although, as you can see it took my until late February to actually finish and post this January recap so let&rsquo;s just keep things in perspective, right?</p>\n<p>Anyhoo, I have been puttering away on <a href=\"https://homomonstrosus.com/\">Homo Monstrosus</a>, tweaking, fussing, etc., and actually updating the <a href=\"https://homomonstrosus.com/now/\">/now</a> page I built in the Fall.</p>\n<p>I&rsquo;ve also finally completed a several-year (albeit with huuuuuge gaps) project of organizing and cataloging my personal digital photo archive. Most significantly, I&rsquo;ve made dozens of themed albums, in part for personal organization, but also so that I can begin to go through these photos and albums, and begin to create themed public galleries to be posted&hellip; somewhere. I&rsquo;m still figuring that part out. Stay tuned.</p>\n<p>I&rsquo;ve always thought in a different universe I would have got deep into photography. I took 3 years of (film) photography classes in high school and by the end was developing color photos by hand. That was nearly the post-high school path I took. Maybe it should have been? Another post, for another day.</p>\n<p>I&rsquo;m looking forward to sharing the pictures I have taken with&hellip; whatever random internet weirdos happen to find this place. Welcome weirdos, I am one of you. Take me in and share your weird secrets with me. I&rsquo;ll show you cool pictures of cats and flowers and the sky.</p>\n<h2 id=\"reading\">Reading</h2>\n<p><strong>I want to read more this year</strong>, but I&rsquo;m also broadly focused on taking stock of what is around me, clearing out archives, and being deliberate with that reading - especially internet-based reading. I&rsquo;ve been pruning my digital inputs, trying to remove sites and apps that I don&rsquo;t actually <em>engage</em> with, but rather keep scrolling through hoping for a hit of dopamine.</p>\n<p>This tactic, of locking myself in a playpen with options, but healthy, curated ones is something I&rsquo;ve been implementing in stages since the Fall, and it seems to be working for me. To that end, instead of scrolling Instagram, or the algorithmically-focused-on-outrage news app, I&rsquo;ve been diving through my embarrassingly huge <a href=\"https://getpocket.com\">Pocket</a> archive, and even stepped back in time and set up a good old fashioned feed reader with limited and deliberate subscriptions. I no longer want access to anything and everything I might want to read; I want easy, direct, no-distraction access to a few, carefully selected feeds from sources I am looking forward to reading each time they post. I don&rsquo;t want to skim, to get the gist. I want to engage and build relationships with pieces, authors, and sources.</p>\n<p>At some point, I should probably document here the feeds I do follow and consume regularly (Man, people really seem to hate that word, &ldquo;consume&rdquo;&hellip; I recognize how it can be seen as a shallow replacement for engagement, but to me it also can have connotations of engaging-with-wholehearted-aplomb. Devouring, etc.), but for now I just want to mention the current highlight and darling of my regular &lsquo;net-based reading has been the posting of British author <a href=\"https://tom-cox.com/?post_type=post\">Tom Cox</a>.</p>\n<blockquote>\n<p>I get like this sometimes, lose my focus, then reel it back in. It’s part of the pattern, inevitable, crucial. But I notice I need to guard against it more than I did in the past. It’s the incessant, troubling speed of everything.</p>\n</blockquote>\n<p><em><a href=\"https://tom-cox.com/writing/the-incessant-troubling-speed-of-everything/\">Source</a></em></p>\n<p>I love his style, from his <a href=\"https://tom-cox.com/writing/darkening-days-in-summerland-a-personal-compendium/\">journal-style compendium posts</a> to his more creative and <a href=\"https://tom-cox.com/writing/some-recommended-walks/\">wonderfully weird</a> writing and ramblings. Probably the most excited I&rsquo;ve been to find a new writer in a long time. Now I should probably read his books&hellip;\n<!-- raw HTML omitted --></p>\n<p><strong>Perhaps the only thing more embarrassing and daunting than my Pocket queue is my comic book backlog.</strong> The good news about such a large backlog is that I can grab literally anything from it and find something I enjoy. And that&rsquo;s why I&rsquo;ve been devouring <strong>Sonic the Hedgehog</strong> comics, the most recent run, available with my Comixology Unlimited subscription. These aren&rsquo;t the deepest and most life-changing books, but they are fun as heck, vibrantly drawn and colored, and a wonderful companion to <em>Sonic Frontiers</em>.</p>\n<p>However, for something with more artistic substance and depth, I finally started Kelly Sue DeConnicks&rsquo;s incredible, revolutionary and beautiful <em>Wonder Woman Historia: The Amazons</em> series. There&rsquo;s no way in a few lines to describe how great and intense this book is, from the writing to the jaw-dropping art. Just read it. That&rsquo;s what I&rsquo;m doing. First two issues down, though I keep re-reading them instead of moving on the third. Like <em>Sonic Frontiers</em>, I just don&rsquo;t want it to be over&hellip;\n<!-- raw HTML omitted --></p>\n<p><strong>For Christmas, D got me the collected poetry of Gary Snyder</strong>. Despite being and English major and loving poems, I can&rsquo;t remember if I&rsquo;ve ever sat down with a book of poetry and just went through it beginning to end, page by page. I&rsquo;ve read a lot of say, Whitman, but by bouncing around from thing to thing, following threads and thoughts, flipping to random pages, etc. There&rsquo;s nothing wrong with that approach; it&rsquo;s organic and leads to wonderful discoveries, but this time, I wanted to try something more measured.</p>\n<p>I&rsquo;ve made it through <em>Riprap</em>, Snyder&rsquo;s first collection, and loved it. Poetry in general is a real challenge to me in a lot of ways. It must be sipped, cannot be gulped. It openly mocks and destroys the &ldquo;pages-per-day&rdquo; type quantification I usually plan and measure my reading habit in. This is exactly why I need it in my life. Interaction with poetry takes as long as it takes, and rewards not by completion but engagement.</p>\n<p>Reading <em>Riprap</em> has made me want to reread <em>Dharma Bums</em>, where I was first introduced to Snyder via Kerouac. I didn&rsquo;t get to start the novel in January. Let&rsquo;s see if that&rsquo;s something that shows up in the February recap&hellip;</p>\n<h2 id=\"and-in-the-remaining-hours\">And in the remaining hours&hellip;</h2>\n<p><strong>I didn&rsquo;t game nearly as much as I thought I would in January</strong>, mainly because I spent so much of my free time working on the above mentioned projects. I am always so hot and cold with this sort of thing, I either do nothing but game - often at the detriment to anything else I want to engage with - or I don&rsquo;t touch the controller for weeks, absorbed in other things. I really would like balance. Some of everything. Slow, steady movement forward through a few different streams. That is something I am working towards, trying to train myself for - though I wonder if it is something that is even possible for me, and if I should just embrace this particular part of my nature. But that&rsquo;s a whole other post for another time.</p>\n<p>I did play <em>Sonic Frontiers</em>, which I started essentially the day it came out in December. I absolutely adore it - and Sonic in general - but as alluded to earlier, I admit I&rsquo;ve been slow to finish it, in part because I just don&rsquo;t want it to be over. This is why I have never actually finished <em>Breath of the Wild</em> despite it being possibly my favorite game ever and having it since 2017.</p>\n<p>I also started and got a fair way through <em>Final Fantasy Adventure</em> for the Game Boy via the <em>Collection of Mana</em> for the Switch. I got that compilation for <em>Secrets</em> and <em>Trials of Mana</em>, which I&rsquo;ve never played and only recently heard of (I was a Sega kid, hence the Sonic obsession). But I am weird about starting at the beginning of series, and a sucker for Game Boy games, and so had to dive into this one. So far, despite its age and related clunkiness, I am enjoying it a lot, and the chance to name the two main characters after both our current cat and our recently departed one has been unexpectedly meaningful&hellip;</p>\n<p>(The main hero is male, and I decided to name him after Aloy before we actually discovered his true sex. An interesting premonition?)\n<!-- raw HTML omitted --></p>\n<p><strong>A great addition to this year has been me and D&rsquo;s decision to commit to weekly movie nights.</strong> We both love movies and always want to watch more, but as with so many things we just&hellip; don&rsquo;t, at least not regularly. But in December, D said enough was enough and she watched 31 movies in 31 days! I watched most of them with her and was vaguely around for the rest and while that kind of hyper-focus is a lot even for me, it inspired us to try and commit to a movie-watching practice in 2023 that was perhaps a little more manageable. So enter Weekly Movie Night! In January we watched:</p>\n<ul>\n<li><em>Knives Out</em></li>\n<li><em>Only Lovers Left Alive</em></li>\n<li><em>Jurassic World</em></li>\n<li><em>Jurassic World: Fallen Kingdom</em></li>\n</ul>\n<p>Generally, we&rsquo;re going to alternate picking movies, with <em>Knives Out</em> being my first pick and <em>Only Lovers</em>, D&rsquo;s. But we also decided to go through the <em>Jurassic World</em> Trilogy with my dad, which none of us had seen yet (the movies, not my dad - we can see him, and do, fairly regularly). Every movie we&rsquo;ve watched so far has been highly enjoyable, with the first two quickly becoming deep favorites for me and D. <em>Fallen Kingdom</em> is the weak link of the bunch, but I still enjoyed it and am a sucker for the entire larger franchise and am looking forward to finishing it out in February.</p>\n<h2 id=\"and-further-on\">&hellip;and further on</h2>\n<p><strong>That was January.</strong> It was&hellip; a lot? And by that, I mean, I did a lot? I just can&rsquo;t help ending those sentences with question marks because I am still not used to the fact that I am, indeed, Doing Things. The Things I want to be doing, no less. I don&rsquo;t expect February to have the same sort of momentum (spoiler alert: it does not) but I have enough moving that I am optimistic I can build on this month, lay down more coats on this foundation, and continue to make incremental progress on the things that are important to me.</p>\n<p>And if all else fails, there is still cat. Good cat. Pretty cat. Speaking of, behold, <strong>Aloy, Prince of Cones</strong> 📷:</p>\n<p><img src=\"https://poetryandmadness.micro.blog/uploads/2024/prince-of-cones.jpg\" alt=\"A kitten lies on a large pillow wearing a cone around his neck to prevent him from licking stitches, earning him the nickname, The Prince of Cones. He looks adorable and exasperated.\"></p>\n<p>Cat tax paid. See you next month!</p>",
				"content_text": "**January lasted about 37 days.** It wasn't a bad month, but it was a long month. 2023 has come in like... a... Do we even have anything to compare to anymore? Whatever it was, here is how the start of 2023 went for me:\n\n<!--more-->\n\n## Aloy \n**The month started off with a discovery: Aloy, our kitten 🐈, Champion of the Nora, Savior of Meridian, was... a boy.** We got Aloy (yes, named after _that_ [Aloy](https://horizon.fandom.com/wiki/Aloy))in late October when they were about two months old. We were told they were female, and had no reason to question that. Since then, three different vets and who-knows-how-many vet techs examined this cat, but it was only as they were literally about to spay her that they realized, hold on, that's a penis.\n\nOur vet called us from the operation, moments before the first cut, and she was so embarrassed. We weren't mad at all, but we were... surprised. So, Aloy got neutered instead and we had to re-learn our cat's pronouns.\n\nAloy the Boy got to keep his name, lost his balls, and gained... a cone.\n\nOh God, the cone. Could one apparatus simultaneously confer such shame, confusion, rage, humiliation, helplessness, and desperation upon its wearer as this cone did to poor Aloy? The looks of abject sadness. The complete inability to remember how to eat in it, how to drink. The repeated, melodramatic attempts - FLIP, SIGH, PLOP - to get comfortable. \n\nOnce the cone was off and new normality was established, it was time to make the basement Aloy-proof, or at least approach that impossible goal as thoroughly as we could. Since his arrival, Aloy had been restricted to roaming the first floor, and I have been working most days up there with him and D. But my office is in the basement, and I was ready to get back down there - though I didn't want to do so until Aloy was ready to have access to expanded territory.\n\nThe basement has needed to be cleaned and severely reorganized since the Fall anyway. It wasn't remotely cat safe, but Aloy wasn't remotely cat-responsible enough to be down there, even if it was made \"safe\", until very recently. So over the first few weeks of the month, I cleaned and prepped my office and solidified the main room down there as The Studio, half workout gym/studio for D, half craft/collage/workshop space for both of us. Frankly, the basement has probably never been this clean or organized the whole time we've lived here. All it took was a tiny cat with apparently confusing genitals. \n\n## The Arch-Book, etc.\n**I've been puttering around with this blog, my website, and web-related creativity on and off (more \"off\") for a while now.** It's been part of a larger project to pivot how I spend my time, and to engage with new and refined practices and processes. In short, I'm trying to live a more deliberate life, spend my time the way I believe I want to, instead of the ways I happen to drift into.  This has manifested in redefining my daily routines, the devices I use, and how I use them.\n\nAnd somehow as part of that quest, quite randomly, I decided to make my erstwhile Chromebook an intrinsic part of that processes.\n\nI've discussed [elsewhere](https://write.as/poetry-and-madness/the-origin-of-the-arch-book) the project and how unexpectedly it came to be. Basically, my MacBook is getting old, and likes to stay plugged into the wall most of the time, so I needed a device I could bring around the house with me, more focused on typing and creating content. The MacBook's battery has been flakey for a while, and I've been working around that by just... not doing the sort of generative, creative work I claim to want to do. With the MacBook downstairs plugged in and a new cat upstairs quite literally demanding my attention, it was the perfect excuse to keep kicking the can. Until one day, I picked up the can, opened it, and out popped the peanut brittle snakes of a knotty hardware project.\n\nSo for about 10 days, I spent nearly every moment of spare time learning how to install and use Linux on a machine intended to serve a purpose I have to some degree been avoiding for... twenty years? And it's... worked?\n\nCreating the `arch-book` and redistributing my digital life across a different arrangement of devices naturally triggered many knock-on projects, but the majority of them were all still aligned with my larger set of goals: spend my time deliberately, facilitate meaningful reading/watching/listening experiences, build creative and journalistic practices.\n\nBy the end of the month, by and large the infrastructure of this part of my life is up and running. It will always be an active process; there will be endless tweaking (both with Linux, and my life), but so far the maintenance hasn't over-shadowed the actual work I want to get done. The `arch-book` sits right in the middle of all of this, and besides being an important cog, and a valuable tech project... it's just damn fun to use.\n\n## Building, Creating, etc.\n**I've been more active on this blog, comparatively speaking.** Although, as you can see it took my until late February to actually finish and post this January recap so let's just keep things in perspective, right?\n\nAnyhoo, I have been puttering away on [Homo Monstrosus](https://homomonstrosus.com/), tweaking, fussing, etc., and actually updating the [/now](https://homomonstrosus.com/now/) page I built in the Fall. \n\nI've also finally completed a several-year (albeit with huuuuuge gaps) project of organizing and cataloging my personal digital photo archive. Most significantly, I've made dozens of themed albums, in part for personal organization, but also so that I can begin to go through these photos and albums, and begin to create themed public galleries to be posted... somewhere. I'm still figuring that part out. Stay tuned.\n\nI've always thought in a different universe I would have got deep into photography. I took 3 years of (film) photography classes in high school and by the end was developing color photos by hand. That was nearly the post-high school path I took. Maybe it should have been? Another post, for another day. \n\nI'm looking forward to sharing the pictures I have taken with... whatever random internet weirdos happen to find this place. Welcome weirdos, I am one of you. Take me in and share your weird secrets with me. I'll show you cool pictures of cats and flowers and the sky.\n\n## Reading\n\n**I want to read more this year**, but I'm also broadly focused on taking stock of what is around me, clearing out archives, and being deliberate with that reading - especially internet-based reading. I've been pruning my digital inputs, trying to remove sites and apps that I don't actually _engage_ with, but rather keep scrolling through hoping for a hit of dopamine. \n\nThis tactic, of locking myself in a playpen with options, but healthy, curated ones is something I've been implementing in stages since the Fall, and it seems to be working for me. To that end, instead of scrolling Instagram, or the algorithmically-focused-on-outrage news app, I've been diving through my embarrassingly huge [Pocket](https://getpocket.com) archive, and even stepped back in time and set up a good old fashioned feed reader with limited and deliberate subscriptions. I no longer want access to anything and everything I might want to read; I want easy, direct, no-distraction access to a few, carefully selected feeds from sources I am looking forward to reading each time they post. I don't want to skim, to get the gist. I want to engage and build relationships with pieces, authors, and sources.\n\nAt some point, I should probably document here the feeds I do follow and consume regularly (Man, people really seem to hate that word, \"consume\"... I recognize how it can be seen as a shallow replacement for engagement, but to me it also can have connotations of engaging-with-wholehearted-aplomb. Devouring, etc.), but for now I just want to mention the current highlight and darling of my regular 'net-based reading has been the posting of British author [Tom Cox](https://tom-cox.com/?post_type=post). \n\n> I get like this sometimes, lose my focus, then reel it back in. It’s part of the pattern, inevitable, crucial. But I notice I need to guard against it more than I did in the past. It’s the incessant, troubling speed of everything.\n\n_[Source](https://tom-cox.com/writing/the-incessant-troubling-speed-of-everything/)_\n\nI love his style, from his [journal-style compendium posts](https://tom-cox.com/writing/darkening-days-in-summerland-a-personal-compendium/) to his more creative and [wonderfully weird](https://tom-cox.com/writing/some-recommended-walks/) writing and ramblings. Probably the most excited I've been to find a new writer in a long time. Now I should probably read his books...\n<br />\n\n**Perhaps the only thing more embarrassing and daunting than my Pocket queue is my comic book backlog.** The good news about such a large backlog is that I can grab literally anything from it and find something I enjoy. And that's why I've been devouring **Sonic the Hedgehog** comics, the most recent run, available with my Comixology Unlimited subscription. These aren't the deepest and most life-changing books, but they are fun as heck, vibrantly drawn and colored, and a wonderful companion to _Sonic Frontiers_.\n\nHowever, for something with more artistic substance and depth, I finally started Kelly Sue DeConnicks's incredible, revolutionary and beautiful _Wonder Woman Historia: The Amazons_ series. There's no way in a few lines to describe how great and intense this book is, from the writing to the jaw-dropping art. Just read it. That's what I'm doing. First two issues down, though I keep re-reading them instead of moving on the third. Like _Sonic Frontiers_, I just don't want it to be over...\n<br />\n\n**For Christmas, D got me the collected poetry of Gary Snyder**. Despite being and English major and loving poems, I can't remember if I've ever sat down with a book of poetry and just went through it beginning to end, page by page. I've read a lot of say, Whitman, but by bouncing around from thing to thing, following threads and thoughts, flipping to random pages, etc. There's nothing wrong with that approach; it's organic and leads to wonderful discoveries, but this time, I wanted to try something more measured.\n\nI've made it through _Riprap_, Snyder's first collection, and loved it. Poetry in general is a real challenge to me in a lot of ways. It must be sipped, cannot be gulped. It openly mocks and destroys the \"pages-per-day\" type quantification I usually plan and measure my reading habit in. This is exactly why I need it in my life. Interaction with poetry takes as long as it takes, and rewards not by completion but engagement.\n\nReading _Riprap_ has made me want to reread _Dharma Bums_, where I was first introduced to Snyder via Kerouac. I didn't get to start the novel in January. Let's see if that's something that shows up in the February recap...\n\n## And in the remaining hours...\n**I didn't game nearly as much as I thought I would in January**, mainly because I spent so much of my free time working on the above mentioned projects. I am always so hot and cold with this sort of thing, I either do nothing but game - often at the detriment to anything else I want to engage with - or I don't touch the controller for weeks, absorbed in other things. I really would like balance. Some of everything. Slow, steady movement forward through a few different streams. That is something I am working towards, trying to train myself for - though I wonder if it is something that is even possible for me, and if I should just embrace this particular part of my nature. But that's a whole other post for another time.\n\nI did play _Sonic Frontiers_, which I started essentially the day it came out in December. I absolutely adore it - and Sonic in general - but as alluded to earlier, I admit I've been slow to finish it, in part because I just don't want it to be over. This is why I have never actually finished _Breath of the Wild_ despite it being possibly my favorite game ever and having it since 2017.\n\nI also started and got a fair way through _Final Fantasy Adventure_ for the Game Boy via the _Collection of Mana_ for the Switch. I got that compilation for _Secrets_ and _Trials of Mana_, which I've never played and only recently heard of (I was a Sega kid, hence the Sonic obsession). But I am weird about starting at the beginning of series, and a sucker for Game Boy games, and so had to dive into this one. So far, despite its age and related clunkiness, I am enjoying it a lot, and the chance to name the two main characters after both our current cat and our recently departed one has been unexpectedly meaningful...\n\n(The main hero is male, and I decided to name him after Aloy before we actually discovered his true sex. An interesting premonition?)\n<br />\n\n**A great addition to this year has been me and D's decision to commit to weekly movie nights.** We both love movies and always want to watch more, but as with so many things we just... don't, at least not regularly. But in December, D said enough was enough and she watched 31 movies in 31 days! I watched most of them with her and was vaguely around for the rest and while that kind of hyper-focus is a lot even for me, it inspired us to try and commit to a movie-watching practice in 2023 that was perhaps a little more manageable. So enter Weekly Movie Night! In January we watched:\n\n* _Knives Out_\n* _Only Lovers Left Alive_\n* _Jurassic World_\n* _Jurassic World: Fallen Kingdom_\n\nGenerally, we're going to alternate picking movies, with _Knives Out_ being my first pick and _Only Lovers_, D's. But we also decided to go through the _Jurassic World_ Trilogy with my dad, which none of us had seen yet (the movies, not my dad - we can see him, and do, fairly regularly). Every movie we've watched so far has been highly enjoyable, with the first two quickly becoming deep favorites for me and D. _Fallen Kingdom_ is the weak link of the bunch, but I still enjoyed it and am a sucker for the entire larger franchise and am looking forward to finishing it out in February. \n\n## ...and further on\n\n**That was January.** It was... a lot? And by that, I mean, I did a lot? I just can't help ending those sentences with question marks because I am still not used to the fact that I am, indeed, Doing Things. The Things I want to be doing, no less. I don't expect February to have the same sort of momentum (spoiler alert: it does not) but I have enough moving that I am optimistic I can build on this month, lay down more coats on this foundation, and continue to make incremental progress on the things that are important to me.\n\nAnd if all else fails, there is still cat. Good cat. Pretty cat. Speaking of, behold, **Aloy, Prince of Cones** 📷:\n\n![A kitten lies on a large pillow wearing a cone around his neck to prevent him from licking stitches, earning him the nickname, The Prince of Cones. He looks adorable and exasperated.](https://poetryandmadness.micro.blog/uploads/2024/prince-of-cones.jpg)\n\nCat tax paid. See you next month!\n\n\n\n",
				"date_published": "2023-02-22T19:32:32-06:00",
				"url": "https://poetryandmadness.micro.blog/2023/02/22/doldrums-defied-a.html",
				"tags": ["📷","Aloy"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2023/02/03/trees.html",
				"title": "Trees 01",
				"content_html": "<p><em>&ldquo;How strong, vital, enduring! how dumbly eloquent!&quot;</em></p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<ul>\n<li>01 - 7 april 2019</li>\n<li>02 - 20 nov 2021</li>\n<li>03 - 13 may 2020</li>\n<li>04 - 19 jan 2020</li>\n<li>05 - 30 aug 2016</li>\n<li>06 - 1 apr 2014</li>\n</ul>\n<p><em>This album can also be found on <a href=\"https://snap.as/homomonstrosus/trees-01\">snap.as</a>.</em></p>",
				"content_text": "_\"How strong, vital, enduring! how dumbly eloquent!\"_\n\n<div class=\"adaptive_photo_layout\">\n    <ul>\n        <li>\n            <a href=\"https://poetryandmadness.micro.blog/uploads/2024/trees-01-01.jpg\">\n                <img src=\"https://poetryandmadness.micro.blog/uploads/2024/trees-01-01.jpg\" alt=\"Looking up at a pale blue sky from beneath large cottonwood trees, bare of any leaves\" loading=\"lazy\">\n            </a>\n        </li>\n        <li>\n            <a href=\"https://poetryandmadness.micro.blog/uploads/2024/trees-01-02.jpg\">\n                <img src=\"https://poetryandmadness.micro.blog/uploads/2024/trees-01-02.jpg\" alt=\"Thin branches with sparse wispy leaves against the backdrop of a sky with a few spring time clouds.\" loading=\"lazy\">\n            </a>\n        </li>\n        <li>\n            <a href=\"https://poetryandmadness.micro.blog/uploads/2024/trees-01-03.jpg\">\n                <img src=\"https://poetryandmadness.micro.blog/uploads/2024/trees-01-03.jpg\" alt=\"Dense, twisting branches infront of a gray sky.\" loading=\"lazy\">\n            </a>\n        </li>\n        <li>\n            <a href=\"https://poetryandmadness.micro.blog/uploads/2024/trees-01-04.jpg\">\n                <img src=\"https://poetryandmadness.micro.blog/uploads/2024/trees-01-04.jpg\" alt=\"Silhouette of a small tree lit from behind by a distant sunset.\" loading=\"lazy\">\n            </a>\n        </li>\n        <li>\n            <a href=\"https://poetryandmadness.micro.blog/uploads/2024/trees-01-05.jpg\">\n                <img src=\"https://poetryandmadness.micro.blog/uploads/2024/trees-01-05.jpg\" alt=\"Silhouette of a huge tree with the late afternoon sun and some puffy clouds behind.\" loading=\"lazy\">\n            </a>\n        </li>\n        <li>\n            <a href=\"https://poetryandmadness.micro.blog/uploads/2024/trees-01-06.jpg\">\n                <img src=\"https://poetryandmadness.micro.blog/uploads/2024/trees-01-06.jpg\" alt=\"A distant, veiled sun faintly glows through gray clouds and the branches of a tree\" loading=\"lazy\">\n            </a>\n        </li>\n    </ul>\n</div>\n<!--more-->\n<hr>\n\n* 01 - 7 april 2019\n* 02 - 20 nov 2021\n* 03 - 13 may 2020\n* 04 - 19 jan 2020\n* 05 - 30 aug 2016\n* 06 - 1 apr 2014\n\n_This album can also be found on [snap.as](https://snap.as/homomonstrosus/trees-01)._\n",
				"date_published": "2023-02-03T19:00:00-06:00",
				"url": "https://poetryandmadness.micro.blog/2023/02/03/trees.html",
				"tags": ["photos","albums"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2023/01/27/morning-computer-jan.html",
				"title": "morning computer 003",
				"content_html": "<p><img src=\"https://i.imgur.com/vg3r6NU.jpg\" alt=\"Snowy woods\">\nfrom: <a href=\"https://thecreativeindependent.com/approaches/year-end-on-moving-to-the-woods/\">Year End: On moving to the woods</a></p>\n<!-- raw HTML omitted -->\n<blockquote>\n<p>Something I&rsquo;m coming to know in my bones is this: I&rsquo;ve come back to what matters over and over again, even when the timescale exceeds my limited perspective. I have every reason to have faith in myself.</p>\n</blockquote>\n<p>Lucy Bellwood in <a href=\"https://buttondown.email/lucybellwood/archive/winter-bottleship-20222023/\">Winter Bottleship, 2022/2023</a></p>\n<!-- raw HTML omitted -->\n<blockquote>\n<p>[…] realising, properly, for the first time, that one day in the future I would no longer be here on earth, existing as the small but very definite and palpable thing I had become.</p>\n</blockquote>\n<p>Tom Cox in <a href=\"https://tomcox.substack.com/p/old-photos\">Old Photos</a></p>\n",
				"content_text": "![Snowy woods](https://i.imgur.com/vg3r6NU.jpg)\nfrom: [Year End: On moving to the woods](https://thecreativeindependent.com/approaches/year-end-on-moving-to-the-woods/)\n\n<hr />\n\n> Something I'm coming to know in my bones is this: I've come back to what matters over and over again, even when the timescale exceeds my limited perspective. I have every reason to have faith in myself.\n\nLucy Bellwood in [Winter Bottleship, 2022/2023](https://buttondown.email/lucybellwood/archive/winter-bottleship-20222023/)\n\n<hr />\n\n> […] realising, properly, for the first time, that one day in the future I would no longer be here on earth, existing as the small but very definite and palpable thing I had become.\n\n Tom Cox in [Old Photos](https://tomcox.substack.com/p/old-photos)\n",
				"date_published": "2023-01-27T12:06:26-06:00",
				"url": "https://poetryandmadness.micro.blog/2023/01/27/morning-computer-jan.html",
				"tags": ["morning computer","quotes"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2023/01/23/the-origin-of.html",
				"title": " The Origin of the arch-book",
				"content_html": "<p>What began as an impulsive project on a Friday afternoon turned into a 4 - 5 day <em>extravaganza</em>.</p>\n<p>The <strong><code>arch-book</code></strong> is actually a <strong>Dell Chromebook 11</strong> from a few years ago. It is old enough that the newer ChromeOS updates didn&rsquo;t run great on it, but it is otherwise a good machine with a nice, simple, utilitarian form factor. I really like it, and always lamented never using it to its fullest potential.  A few years ago, I messed around with putting GalliumOS on it. That was fine but a) I never worked on it long enough to get all of the kinks out, and 2) I never really decided <em>how</em> I would use it once it was set up. I never integrated it into my daily practice and habits. And that was fine, I suppose; it was a hobby project. But I still felt like I was wasting a cool piece of tech.</p>\n<p>Then last week with no warning, I decided to dust off this machine to see if I can make it a usable part of my day-to-day practice.</p>\n<p>My goals for this machine are to be able to:</p>\n<ul>\n<li>write markdown in a lightweight editor</li>\n<li>browse the internet for blog posting, research, and light account/website maintenance</li>\n<li>BONUS: update <a href=\"https://homomonstrosus.com/\">homomonstrosus.com</a> in a simple, lightweight development environment</li>\n</ul>\n<p>That&rsquo;s it. I didn&rsquo;t want a whole office suite or full connectivity to all of my ecosystems all the time. And perhaps most importantly, I didn&rsquo;t want a general purpose device that could do a bit of everything. I like using this thing; I like playing with it. If I made it so it could do <em>anything</em>, all I&rsquo;d end up doing on it would be path-of-least-resistance type stuff.</p>\n<p>Instead, I wanted, Oh, you like playing with this? Well all it is, is a tool for <em>writing</em>. If you&rsquo;re going to use it, you&rsquo;re going to use it for that. For <strong>creation</strong>. I hoped that could trick myself into finding excuses to use it, and therefore to write&hellip; and I think its working.</p>\n<p>I will admit I was somewhat inspired by <em>Only Lovers Left Alive</em> in this project. I loved how Adam built all of these wonderful systems with old, &ldquo;outdated&rdquo; tech. I loved the idea that someone living through all of this technoligical change wouldn&rsquo;t need to be cutting edge. If something <strong>worked</strong> why move on to the next iteration simply because it was the next? There&rsquo;s no reason things can&rsquo;t be improved and integrated without being abandoned.</p>\n<p>With these goals in mind - actually, I couldn&rsquo;t say that. This project was so impulsive, I can&rsquo;t say I had <em>any</em> goal in mind when I started it. I didn&rsquo;t even set out to start a project per se. I randomly wanted to dust off this machine. Does it still work? Yeah? Oh, GalliumOS is shutting down? Damn. Can I put something else on it? Cool, I&rsquo;ll do that.</p>\n<p>And thus a thread was pulled and&hellip; here we are, almost a week later.</p>\n<p>This all happened in the way it did because I found a very thorough guide tailored not just to Chromebooks, but to THIS Chromebook, the <strong>Dell Chromebook 11</strong> here:</p>\n<ul>\n<li><code>https://wiki.archlinux.org/title/Dell_Chromebook_11</code></li>\n</ul>\n<p>&hellip;and that&rsquo;s what caused me to put <a href=\"https://archlinux.org/\">Arch Linux</a> on it. I just wanted <em>something</em> and Arch had a detailed walk-through, so&hellip; sure! Later, deep in the process, I did start to remember some things I learned the last time I tiptoed into linux: that Arch is a little more dense or at least a little more <em>hands on</em>&hellip; and that it didn&rsquo;t come with a visual environment. But since I kind of blustered into this project in the first place, I just kept lumbering along, working through things. It was challenging but rewarding and continues to be so. Most of the time -</p>\n<p>&hellip;I just had to stop in the middle of this entry to go figure out why spellchecking wasn&rsquo;t working in my text editor. It was a bit of a wild goose chase. I came away knowing a little more about how linux, etc. works, but also realizing that 90% of my issues are from typos/details I miss.</p>\n<p>Setting up this machine has been ripe with these whack-a-mole sessions. I honestly do enjoy fixing and learning from them, but they also impede my momentum to actually get USING this thing. Every other step I take towards daily use I need to divert and walk around for 5 miles fixing some random issue. I am hoping that this sort of things tapers off the closer I get running this through my daily routines.</p>\n<p>ANYWAY.</p>\n<p>Here&rsquo;s what I did:</p>\n<h2 id=\"1-mrchromebox\">1. mrchromebox</h2>\n<p>A few years ago, to get GalliumOS on this thing, I did&hellip; uh something to the BIOS? It wasn&rsquo;t bad - I didn&rsquo;t mess anything up - I just don&rsquo;t remember what exactly I did. Whatever it was, it came with an (known) issue where if the battery got completely drained, I&rsquo;d have to manually enable a certain kind of boot mode before I could load linux again. And I used the machine just infrequently enough that I never remembered exactly how to do it and had to look it up and stumble through the process every time.</p>\n<p>So at least this time, I decided to commit, and to follow these:</p>\n<ul>\n<li><code>https://mrchromebox.tech/#fwscript</code></li>\n<li><code>https://wiki.archlinux.org/title/Chrome_OS_devices#Legacy_Boot_Mode</code></li>\n</ul>\n<p>&hellip;and do, uh whatever-it-was thoroughly enough to avoid the above hassle.</p>\n<h2 id=\"2-followed-arch-wiki\">2. followed arch wiki</h2>\n<p>This well-written documentation:</p>\n<ul>\n<li><code>https://wiki.archlinux.org/title/Dell_Chromebook_11</code></li>\n<li><code>https://wiki.archlinux.org/title/Chrome_OS_devices</code></li>\n<li><code>https://wiki.archlinux.org/title/Installation_guide</code></li>\n</ul>\n<p>&hellip;was detailed and accessible enough to get me through almost everything I needed to do. When I got lost in the google woods, it was usually because of a typo or something stupid I did. One setup step of note though, I&hellip;.</p>\n<h3 id=\"2a-partitioned\">2a. partitioned</h3>\n<p>&hellip;1 gig swap, and 10 gigs for data. It was slightly nerve-wracking.</p>\n<pre tabindex=\"0\"><code>https://wiki.archlinux.org/title/Installation_guide#Partition_the_disks\n</code></pre><p>And now, with everything installed, storage is a squeaky fit. I am using a SD card for additional storage as needed.</p>\n<p>If anything, <strong>this is inspiration to keep things very lean</strong>. I just hope having to keep such a close eye on storage doesn&rsquo;t end up bogging things down. So far, so good.</p>\n<p>Hard disk set up and base installation in the books, the next step was to&hellip;</p>\n<h2 id=\"3-look-for-lightweight-graphic-environments\">3. look for lightweight graphic environments</h2>\n<p>As I dutifully plugged away at the wiki, I soon realized that Arch was text-only and I had to go shopping for a window manager. Luckily there is tons of good data out there about lean setups for older machines. I went with <a href=\"https://lxqt-project.org/\">LXQt</a> because it was recommended, and so far I am happy with it.</p>\n<p>After that, I&hellip;</p>\n<h2 id=\"4-installed\">4. installed</h2>\n<p>chromium, ghostwriter*, featherpad</p>\n<ul>\n<li>I loved <a href=\"https://ghostwriter.kde.org/\">ghostwriter</a> from my Gallium install. Can&rsquo;t remember where I first heard about it. But I love a good markdown writer and <strong>ghostwriter</strong> is a good markdown editor. I plan on spending a lot of time with it.</li>\n</ul>\n<p>That reminds me, in terms of installing things, I also got practice&hellip;</p>\n<h2 id=\"5-installing-apps-from-the-arch-user-repo\">5. installing apps from the arch user repo</h2>\n<ul>\n<li><code>https://wiki.archlinux.org/title/Arch_User_Repository</code></li>\n<li><code>https://wiki.archlinux.org/title/Arch_User_Repository#Installing_and_upgrading_packages</code></li>\n</ul>\n<p>&hellip;etc.</p>\n<p>Didn&rsquo;t have many huge problems in the overall arch/LXQt install and set up, and I learned A LOT in the process. Tho there where a few&hellip;</p>\n<h2 id=\"6-notable-issues\">6. notable issues:</h2>\n<h3 id=\"6a-emojis-via-noto-fonts\">6a. emojis via noto fonts</h3>\n<ul>\n<li><code>https://dev.to/darksmile92/get-emojis-working-on-arch-linux-with-noto-fonts-emoji-2a9</code></li>\n<li><code>https://archlinux.org/packages/extra/any/noto-fonts-emoji/</code></li>\n</ul>\n<h3 id=\"6b-the-sleep-debacle\">6b. the sleep debacle</h3>\n<p>Was having an issue where, after a certain amount of time (like, hours), sleep mode would crash and reboot the computer. Did a lot of digging and went down some wrong paths. Ultimately, it seems to be a deep google problem with a known bug messing up the S3 sleep cycle(s):</p>\n<p><em>(Can&rsquo;t find the link to the bug report! Take my word for it!)</em></p>\n<p>My workaround has been to switch to a lighter sleep by setting this in <code>sleep.conf</code> :</p>\n<pre tabindex=\"0\"><code>SuspendState=standby freeze\n</code></pre><ul>\n<li><code>https://www.kernel.org/doc/Documentation/power/states.txt</code></li>\n<li><code>https://www.reddit.com/r/archlinux/comments/102uljt/laptop_will_shutdown_some_hours_after_suspend/</code></li>\n</ul>\n<p>&hellip;which avoids the behavior. I can sleep and wake up just fine, I just save less battery in this lighter sleep. Not thrilled with that, but at least its I can suspe.</p>\n<p>This is another opportunity to travel light and lean. And save often.</p>\n<hr>\n<p>By now, the whack-a-mole is dying down, and I&rsquo;m starting to integrate this into my daily life, along with other habits I&rsquo;m trying to cultivate. I&rsquo;m working to build a cyclic relationship being daily reading and daily writing - journalling, logging, etc.</p>\n<p>So far so good. The <code>arch-book</code> is becoming my go-to digital capture device. I&rsquo;m starting to use it like a digital notebook, and learning how it can compliment my paper notebooks. The separation of concerns between all of these devices, and the iPad, is working so far. Just a little friction to make the system tactile.</p>\n<p>Downstairs the macbook anchors this system, though now tethered to power most of the time. They are the workhorse, holding it all together. Things feel a little tenous, but I like stitching things together and am up for the challenge.</p>",
				"content_text": "What began as an impulsive project on a Friday afternoon turned into a 4 - 5 day _extravaganza_. \n\nThe **`arch-book`** is actually a **Dell Chromebook 11** from a few years ago. It is old enough that the newer ChromeOS updates didn't run great on it, but it is otherwise a good machine with a nice, simple, utilitarian form factor. I really like it, and always lamented never using it to its fullest potential.  A few years ago, I messed around with putting GalliumOS on it. That was fine but a) I never worked on it long enough to get all of the kinks out, and 2) I never really decided _how_ I would use it once it was set up. I never integrated it into my daily practice and habits. And that was fine, I suppose; it was a hobby project. But I still felt like I was wasting a cool piece of tech.\n\nThen last week with no warning, I decided to dust off this machine to see if I can make it a usable part of my day-to-day practice. \n\n<!--more-->\n\nMy goals for this machine are to be able to:\n\n* write markdown in a lightweight editor\n* browse the internet for blog posting, research, and light account/website maintenance\n* BONUS: update [homomonstrosus.com](https://homomonstrosus.com/) in a simple, lightweight development environment\n\nThat's it. I didn't want a whole office suite or full connectivity to all of my ecosystems all the time. And perhaps most importantly, I didn't want a general purpose device that could do a bit of everything. I like using this thing; I like playing with it. If I made it so it could do _anything_, all I'd end up doing on it would be path-of-least-resistance type stuff. \n\nInstead, I wanted, Oh, you like playing with this? Well all it is, is a tool for *writing*. If you're going to use it, you're going to use it for that. For **creation**. I hoped that could trick myself into finding excuses to use it, and therefore to write... and I think its working.\n\nI will admit I was somewhat inspired by *Only Lovers Left Alive* in this project. I loved how Adam built all of these wonderful systems with old, \"outdated\" tech. I loved the idea that someone living through all of this technoligical change wouldn't need to be cutting edge. If something **worked** why move on to the next iteration simply because it was the next? There's no reason things can't be improved and integrated without being abandoned. \n\nWith these goals in mind - actually, I couldn't say that. This project was so impulsive, I can't say I had _any_ goal in mind when I started it. I didn't even set out to start a project per se. I randomly wanted to dust off this machine. Does it still work? Yeah? Oh, GalliumOS is shutting down? Damn. Can I put something else on it? Cool, I'll do that.\n\nAnd thus a thread was pulled and... here we are, almost a week later.\n\nThis all happened in the way it did because I found a very thorough guide tailored not just to Chromebooks, but to THIS Chromebook, the **Dell Chromebook 11** here:\n\n* `https://wiki.archlinux.org/title/Dell_Chromebook_11`\n\n...and that's what caused me to put [Arch Linux](https://archlinux.org/) on it. I just wanted _something_ and Arch had a detailed walk-through, so... sure! Later, deep in the process, I did start to remember some things I learned the last time I tiptoed into linux: that Arch is a little more dense or at least a little more _hands on_... and that it didn't come with a visual environment. But since I kind of blustered into this project in the first place, I just kept lumbering along, working through things. It was challenging but rewarding and continues to be so. Most of the time -\n\n...I just had to stop in the middle of this entry to go figure out why spellchecking wasn't working in my text editor. It was a bit of a wild goose chase. I came away knowing a little more about how linux, etc. works, but also realizing that 90% of my issues are from typos/details I miss. \n\nSetting up this machine has been ripe with these whack-a-mole sessions. I honestly do enjoy fixing and learning from them, but they also impede my momentum to actually get USING this thing. Every other step I take towards daily use I need to divert and walk around for 5 miles fixing some random issue. I am hoping that this sort of things tapers off the closer I get running this through my daily routines.\n\nANYWAY.\n\nHere's what I did:\n\n## 1. mrchromebox\nA few years ago, to get GalliumOS on this thing, I did... uh something to the BIOS? It wasn't bad - I didn't mess anything up - I just don't remember what exactly I did. Whatever it was, it came with an (known) issue where if the battery got completely drained, I'd have to manually enable a certain kind of boot mode before I could load linux again. And I used the machine just infrequently enough that I never remembered exactly how to do it and had to look it up and stumble through the process every time. \n\nSo at least this time, I decided to commit, and to follow these:\n\n* `https://mrchromebox.tech/#fwscript`\n* `https://wiki.archlinux.org/title/Chrome_OS_devices#Legacy_Boot_Mode`\n \n...and do, uh whatever-it-was thoroughly enough to avoid the above hassle.\n\n\n## 2. followed arch wiki\nThis well-written documentation:\n\n* `https://wiki.archlinux.org/title/Dell_Chromebook_11`\n* `https://wiki.archlinux.org/title/Chrome_OS_devices`\n* `https://wiki.archlinux.org/title/Installation_guide`\n\n...was detailed and accessible enough to get me through almost everything I needed to do. When I got lost in the google woods, it was usually because of a typo or something stupid I did. One setup step of note though, I....\n\n### 2a. partitioned \n...1 gig swap, and 10 gigs for data. It was slightly nerve-wracking. \n\n```\nhttps://wiki.archlinux.org/title/Installation_guide#Partition_the_disks\n```\n\nAnd now, with everything installed, storage is a squeaky fit. I am using a SD card for additional storage as needed. \n\nIf anything, **this is inspiration to keep things very lean**. I just hope having to keep such a close eye on storage doesn't end up bogging things down. So far, so good. \n\nHard disk set up and base installation in the books, the next step was to...\n\n## 3. look for lightweight graphic environments\nAs I dutifully plugged away at the wiki, I soon realized that Arch was text-only and I had to go shopping for a window manager. Luckily there is tons of good data out there about lean setups for older machines. I went with [LXQt](https://lxqt-project.org/) because it was recommended, and so far I am happy with it. \n\nAfter that, I...\n\n\n## 4. installed \nchromium, ghostwriter*, featherpad\n\n* I loved [ghostwriter](https://ghostwriter.kde.org/) from my Gallium install. Can't remember where I first heard about it. But I love a good markdown writer and **ghostwriter** is a good markdown editor. I plan on spending a lot of time with it.\n\nThat reminds me, in terms of installing things, I also got practice...\n\n## 5. installing apps from the arch user repo\n\n* `https://wiki.archlinux.org/title/Arch_User_Repository`\n* `https://wiki.archlinux.org/title/Arch_User_Repository#Installing_and_upgrading_packages`\n\n...etc.\n\n\n\nDidn't have many huge problems in the overall arch/LXQt install and set up, and I learned A LOT in the process. Tho there where a few...\n\n## 6. notable issues:\n### 6a. emojis via noto fonts\n\n* `https://dev.to/darksmile92/get-emojis-working-on-arch-linux-with-noto-fonts-emoji-2a9`\n* `https://archlinux.org/packages/extra/any/noto-fonts-emoji/`\n\n### 6b. the sleep debacle \n\nWas having an issue where, after a certain amount of time (like, hours), sleep mode would crash and reboot the computer. Did a lot of digging and went down some wrong paths. Ultimately, it seems to be a deep google problem with a known bug messing up the S3 sleep cycle(s):\n\n_(Can't find the link to the bug report! Take my word for it!)_\n\nMy workaround has been to switch to a lighter sleep by setting this in `sleep.conf` :\n\n```\nSuspendState=standby freeze\n```\n\n\n\n* `https://www.kernel.org/doc/Documentation/power/states.txt`\n* `https://www.reddit.com/r/archlinux/comments/102uljt/laptop_will_shutdown_some_hours_after_suspend/`\n\n\n...which avoids the behavior. I can sleep and wake up just fine, I just save less battery in this lighter sleep. Not thrilled with that, but at least its I can suspe.\n\nThis is another opportunity to travel light and lean. And save often.\n\n***\nBy now, the whack-a-mole is dying down, and I'm starting to integrate this into my daily life, along with other habits I'm trying to cultivate. I'm working to build a cyclic relationship being daily reading and daily writing - journalling, logging, etc.\n\nSo far so good. The `arch-book` is becoming my go-to digital capture device. I'm starting to use it like a digital notebook, and learning how it can compliment my paper notebooks. The separation of concerns between all of these devices, and the iPad, is working so far. Just a little friction to make the system tactile.\n\nDownstairs the macbook anchors this system, though now tethered to power most of the time. They are the workhorse, holding it all together. Things feel a little tenous, but I like stitching things together and am up for the challenge. \n",
				"date_published": "2023-01-23T11:19:42-06:00",
				"url": "https://poetryandmadness.micro.blog/2023/01/23/the-origin-of.html"
			},
			{
				"id": "http://poetryandmadness.micro.blog/2023/01/22/morning-computer-jan.html",
				"title": "morning computer 002",
				"content_html": "<h3 id=\"_i-feel-very-strong-to-do-it_\"><em>&ldquo;I feel very strong to do it.&quot;</em></h3>\n<p><strong>Quotes from Steinbeck&rsquo;s journals:</strong></p>\n<blockquote>\n<p>never temper a word to a reader’s prejudice, but bend it like putty for his understanding.</p>\n</blockquote>\n<p>&hellip;and:</p>\n<blockquote>\n<p>I have tried to keep diaries before but they don’t work out because of the necessity to be honest.</p>\n</blockquote>\n<p>💬 Source: <a href=\"https://www.themarginalian.org/2015/03/02/john-steinbeck-working-days/\">How Steinbeck Used the Diary as a Tool of Discipline, a Hedge Against Self-Doubt, and a Pacemaker for the Heartbeat of Creative Work</a> via <a href=\"https://www.themarginalian.org/\">The Marginalian</a></p>\n",
				"content_text": "### _\"I feel very strong to do it.\"_\n\n**Quotes from Steinbeck's journals:**\n\n> never temper a word to a reader’s prejudice, but bend it like putty for his understanding.  \n\n...and:\n\n> I have tried to keep diaries before but they don’t work out because of the necessity to be honest.\n\n💬 Source: [How Steinbeck Used the Diary as a Tool of Discipline, a Hedge Against Self-Doubt, and a Pacemaker for the Heartbeat of Creative Work](https://www.themarginalian.org/2015/03/02/john-steinbeck-working-days/) via [The Marginalian](https://www.themarginalian.org/)\n",
				"date_published": "2023-01-22T20:55:12-06:00",
				"url": "https://poetryandmadness.micro.blog/2023/01/22/morning-computer-jan.html",
				"tags": ["morning computer","quotes"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2023/01/22/115722.html",
				"title": "morning computer 001",
				"content_html": "<blockquote>\n<p>When you deeply love someone, you can look at them and see the difference between their true nature and a behaviour that’s an expression of suffering.</p>\n</blockquote>\n<p>💬 Source:  <a href=\"https://hazlitt.net/feature/limited-story-yourself-actually-quite-fictional-interview-william-brewer\">‘The Limited Story of Yourself is Actually Quite Fictional’: An Interview with William Brewer </a> by Julie Mannell on <a href=\"https://hazlitt.net/\">HazLitt</a></p>\n",
				"content_text": "> When you deeply love someone, you can look at them and see the difference between their true nature and a behaviour that’s an expression of suffering.\n\n💬 Source:  [‘The Limited Story of Yourself is Actually Quite Fictional’: An Interview with William Brewer ](https://hazlitt.net/feature/limited-story-yourself-actually-quite-fictional-interview-william-brewer) by Julie Mannell on [HazLitt](https://hazlitt.net/)\n",
				"date_published": "2023-01-22T11:57:22-06:00",
				"url": "https://poetryandmadness.micro.blog/2023/01/22/115722.html",
				"tags": ["morning computer","quotes"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2023/01/22/morning-computer-about.html",
				"title": "morning computer 000 - about",
				"content_html": "<blockquote>\n<p>I go through the RSS feeds and newsletters, and compose a morningcomputer post here to condense what I’ve learned that morning that I consider worth retaining and processing. So some days there isn’t one.</p>\n</blockquote>\n<p>source: Warren Ellis in <a href=\"https://warrenellis.ltd/jot/morning-routine-and-work-day-january-2022/\">Morning Routine And Work Day</a></p>\n<p>Dang. That&rsquo;s a great idea. Okay, count me in.</p>\n",
				"content_text": "> I go through the RSS feeds and newsletters, and compose a morningcomputer post here to condense what I’ve learned that morning that I consider worth retaining and processing. So some days there isn’t one.\n\nsource: Warren Ellis in [Morning Routine And Work Day](https://warrenellis.ltd/jot/morning-routine-and-work-day-january-2022/)\n\nDang. That's a great idea. Okay, count me in.\n",
				"date_published": "2023-01-22T11:54:41-06:00",
				"url": "https://poetryandmadness.micro.blog/2023/01/22/morning-computer-about.html",
				"tags": ["morning computer","about"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2022/10/14/oct.html",
				
				"content_html": "<p>In <a href=\"https://poetryandmadness.micro.blog/2022/07/11/project-log-jul.html\">my last post</a> here, I was so worried about the precedent numbered entries in a series would set, I didn&rsquo;t define the scope of the series itself well enough. Or if I did, I don&rsquo;t remember.</p>\n<p>Isn&rsquo;t everything I write here a &ldquo;process log&rdquo;? This is a web log after all (since I am, for some reason, so set on using that particular antiquated phrase&hellip;)</p>\n<p>So here I am! Making progress on my process and uh&hellip; logging it!</p>\n<p>I&rsquo;ve updated <a href=\"https://homomonstrosus.com/\">Homo Monstrosus</a>, in both style and content. And the site has been on my mind more and more - as a tool, a project, a hobby, but also as a shelter, a record, a showcase. Creating and building in general has been on my mind more too, but the front, active part of it, rather than the back(burner), &ldquo;sigh, one day&hellip;&rdquo; part. I am almost building a creative practice. Or rather, I <strong>am</strong> building a creative practice, it&rsquo;s just wobbly like a baby deer. Spooks easily like one too.</p>\n<p>I am still iterating over exactly how I want to exist on the web. Still trying to crystalize and differentiate the ways one can publish web content. I&rsquo;m not talking on a global, capitalism scale, or about being a Content Creator on a social media website or anything like that. I&rsquo;m talking about one person, making (mostly) words and publishing them using the networked tools they have access to.</p>\n<p>I&rsquo;m thinking about the difference between pages that are designed to be dynamic and updated, versus static and time-locked. The blogging revolution brought web publishing to the masses, but it also came with this subconscious implication that the only valid content on the web was the newest, most current, whatever was at the top of the blog. And with <em>that</em> came the idea that &ldquo;old&rdquo; content was somehow less-than. Or that unchanging content, whether by design or as an artifact didn&rsquo;t have a place on the web. Couldn&rsquo;t be trusted. Or maybe those are just implications I wrestled with.</p>\n<p>What do I want to make? Why? Who is it for? <strong>When</strong> is it for?</p>\n<p>These are much more potent and healthy questions than the ones I&rsquo;d traditionally ask like, Can I even make anything? Who do I think I am? Why haven&rsquo;t I done more? Should I just stop kidding myself?</p>\n<p>There&rsquo;s other stuff on my mind. World stuff, obviously. But World-level internet stuff too. It seems very popular these last few months to acknowledge that the web and capitalism appear to be inexorably linked, and that the coupling is killing us, leading us and the planet herself to doom. And that&rsquo;s not wrong, of course, but the situation was incredibly apparent well before Elon Musk said he wanted to buy Twitter (though that event, at least to me, seems to have kicked off the lastest wave of these kind of think pieces&hellip; and again, that&rsquo;s not an inappropriate response.)</p>\n<p>But as much as I generally agree with the sentiment - that&rsquo;s not where I want to live right now. The internet hasn&rsquo;t been what I&rsquo;ve wanted it to be in a long time, well before I realized it. I can&rsquo;t dismantle those systems.</p>\n<p>I <em>can</em> chip away at my little site. Plod around this blog. Build my little chicken coop as the cathedrals fall to the shelling.</p>\n<p>So that&rsquo;s what I&rsquo;m going to do.</p>\n",
				"content_text": "In [my last post](https://poetryandmadness.micro.blog/2022/07/11/project-log-jul.html) here, I was so worried about the precedent numbered entries in a series would set, I didn't define the scope of the series itself well enough. Or if I did, I don't remember.\n\nIsn't everything I write here a \"process log\"? This is a web log after all (since I am, for some reason, so set on using that particular antiquated phrase...)\n\nSo here I am! Making progress on my process and uh... logging it!\n\nI've updated [Homo Monstrosus](https://homomonstrosus.com/), in both style and content. And the site has been on my mind more and more - as a tool, a project, a hobby, but also as a shelter, a record, a showcase. Creating and building in general has been on my mind more too, but the front, active part of it, rather than the back(burner), \"sigh, one day...\" part. I am almost building a creative practice. Or rather, I **am** building a creative practice, it's just wobbly like a baby deer. Spooks easily like one too. \n\nI am still iterating over exactly how I want to exist on the web. Still trying to crystalize and differentiate the ways one can publish web content. I'm not talking on a global, capitalism scale, or about being a Content Creator on a social media website or anything like that. I'm talking about one person, making (mostly) words and publishing them using the networked tools they have access to.\n\nI'm thinking about the difference between pages that are designed to be dynamic and updated, versus static and time-locked. The blogging revolution brought web publishing to the masses, but it also came with this subconscious implication that the only valid content on the web was the newest, most current, whatever was at the top of the blog. And with _that_ came the idea that \"old\" content was somehow less-than. Or that unchanging content, whether by design or as an artifact didn't have a place on the web. Couldn't be trusted. Or maybe those are just implications I wrestled with.\n\nWhat do I want to make? Why? Who is it for? **When** is it for?\n\nThese are much more potent and healthy questions than the ones I'd traditionally ask like, Can I even make anything? Who do I think I am? Why haven't I done more? Should I just stop kidding myself?\n\nThere's other stuff on my mind. World stuff, obviously. But World-level internet stuff too. It seems very popular these last few months to acknowledge that the web and capitalism appear to be inexorably linked, and that the coupling is killing us, leading us and the planet herself to doom. And that's not wrong, of course, but the situation was incredibly apparent well before Elon Musk said he wanted to buy Twitter (though that event, at least to me, seems to have kicked off the lastest wave of these kind of think pieces... and again, that's not an inappropriate response.)\n\nBut as much as I generally agree with the sentiment - that's not where I want to live right now. The internet hasn't been what I've wanted it to be in a long time, well before I realized it. I can't dismantle those systems.\n\nI _can_ chip away at my little site. Plod around this blog. Build my little chicken coop as the cathedrals fall to the shelling.\n\nSo that's what I'm going to do. \n",
				"date_published": "2022-10-14T12:07:57-06:00",
				"url": "https://poetryandmadness.micro.blog/2022/10/14/oct.html"
			},
			{
				"id": "http://poetryandmadness.micro.blog/2022/07/11/project-log-jul.html",
				"title": "Project Log 001",
				"content_html": "<p>The work of my life, at the moment, appears to be centered around living and acting deliberately. I say &ldquo;appears&rdquo; because the more I try to do the Work of Life the more I realize I am discovering it rather than creating it. And like all white male explorers, &ldquo;discovering&rdquo; means &ldquo;finding and realizing things that people who don&rsquo;t look like me embraced and celebrated long, long ago.&rdquo;</p>\n<p>Right now, this work is manifesting in:</p>\n<h2 id=\"the-path\">&ldquo;The Path&rdquo;</h2>\n<p><strong>Daily reading and study into spiritual systems, paths, and modes of thought</strong>, from a perch somewhere between skeptic and seeker. I am just starting this practice, mainly stemming from a desire to spend some daily(ish) time on &ldquo;matters of the soul&rdquo; - whatever that may mean. Right now that means re-reading one of my favorite nonfiction books, Huston Smith&rsquo;s &ldquo;The World&rsquo;s Religions&rdquo;. I read an utterly beleaguered, decades old, mass market copy of &ldquo;The Religions of Man&rdquo; as the book was known in the 70&rsquo;s, and inspired in me some spiritual exploration. I think I am hoping it does it again&hellip;</p>\n<h2 id=\"the-roles\">&ldquo;The Roles&rdquo;</h2>\n<p><strong>Abstracting my goals, desires, and pulls into the concept of &ldquo;roles&rdquo; I want to embody.</strong> I plan to write about this more at length soon. I&rsquo;m not sure how much I&rsquo;ll get into the personal side of this, but the general idea is that rather than looking at my life as a list of tasks I want to do, or accomplishments I want to rack up, it has helped me to instead envision the archetypal (if only to me) roles, personas or&hellip; something close to a D&amp;D class, that I want to embody and explore in my own context. Sounds weird - and it is - but it has also unlocked my brain in certain ways, giving me new and flexible ways to view my life and the things I want to do, and how that informs &ldquo;the person I want to be&rdquo;.</p>\n<p>This way of looking at my life has also lent itself very well to other projects like&hellip;</p>\n<h2 id=\"the-planner\">&ldquo;The Planner&rdquo;</h2>\n<p><strong>Developing and iterating over a personal organization system.</strong> I learned long ago I will likely not succeed in a system created by someone else, but for a long time I thought that let me off the hook of having to put the work in to make one myself. I was wrong. I call this project The Planner, though it is not really a &ldquo;planner&rdquo; or &ldquo;datebook&rdquo; or &ldquo;organizer&rdquo; in the traditional sense. The Planner is the tool, or set of tools, I use to organize and manage my time, and to help me catalogue and prioritize what I want to focus on. When those things happen in concert, the Planner turns &ldquo;time&rdquo; from a vague, ephemeral substance to a finite, consumable resource, a fuel.</p>\n<p>The difference between trying to Do Things without the Planner and with it is the difference between trying to get a Delorean up to 88 MPH in 1885 vs 2015. Without the Planner, to Do Things requires crazy contraptions, mad thinking, and completely impractical and ridiculously inefficient methods of propulsion best suited for singular, Hail Mary moments. With the Planner? I can throw any old junk in my reactor and jet around through time and space causing trouble all I want. AND I get a hover conversion.</p>\n<p><em>(Wow this post has gone off the rails and right into Clint Eastwood Ravine&hellip;)</em></p>\n<p>Or rather, this would all be true, if the Planner was actually a thing. Now it only exists as the platonic idea of the system I aspire too. But the working prototype I&rsquo;m up to now is the best, most flexible version I&rsquo;ve had yet. Integrating the &ldquo;roles&rdquo; concept above adds a narrative element to something usually heavy with charts, lists and flow charts. And lucky for me I love narrative elements AND flow charts.</p>\n<h2 id=\"the-work\">&ldquo;The Work&rdquo;</h2>\n<p><strong>Developing a practice of making/reflecting/recording&hellip;stuff. And things.</strong> Most of my life, I have wanted to create and communicate creatively with the world. I started out in theatre. In my adult life I have settled more into written expression, but that description feels&hellip; limiting. In fact for a long time my byline was &ldquo;I like making things with words.&rdquo; Which is true! Fiction, poetry, but also plays, and code, and zines, and essays, and letters, and&hellip; and&hellip;</p>\n<p>These are things I would like to create, and I have an inconsistent archive (at best) of various attempts over the years. I have made a few Things I am quite proud of; but what I&rsquo;ve never made is a practice of creating them. I can rise to the occasion of an assignment and deadline like nobody&rsquo;s business, but I&rsquo;ve never been able to create those stakes for myself. In lieu of someone else&rsquo;s gun to my head, I need to find away to hold my own&hellip;</p>\n<p>Nope. Not even going to go there.</p>\n<h2 id=\"the-lexicon\">&ldquo;The Lexicon&rdquo;</h2>\n<p><strong>Building the language and grammar to describe everything above.</strong> All of these projects I&rsquo;m working on fit together and interact in ways that I&rsquo;m not going to describe here, in part because I&rsquo;m still discovering it myself. The questions I&rsquo;m trying to answer, the practices I&rsquo;m trying to start, they all swirl around the larger work of finding my place, my way - a project so big it has multiple times swallowed me up deep into its void only to toss my lightyears away, alone and disoriented. It&rsquo;s hard enough to keep my head above water when I can&rsquo;t even talk things through to myself without tripping over the words.</p>\n<blockquote>\n<p>One day I will find the right words, and they will be simple</p>\n</blockquote>\n<p>I&rsquo;ve decided to stop waiting and make that day now. I need the right buckets to sort thoughts and meanings into and finding those buckets is so much harder than it sounds. But having that right word, it&rsquo;s not just a bucket, it&rsquo;s a handle, to pick up an idea and turn it into a tool.</p>\n<p>And so part of this particular project is giving names to&hellip; all the projects. Which I did! Helpful!</p>\n<hr>\n<p>At a high level, these are the things I am most excited about, the things - in a certain context - I want to invest my time and energy in, and the things that I believe will give my life meaning. So, I hope to keep a log of how all of these projects are going, what new projects they spawn, and any notable results from the lot of them.</p>\n<p>I hope that this space can evolve to be so much more than a process log, but I would also be ecstatic if I maintain it even as just that for any length of time. A process log, perhaps more than anything I could do here, would embody my philosophy for this place, best summed up as:</p>\n<blockquote>\n<p>What I write here is not my teaching, but my study; it is not a lesson for others, but for me. And yet it should not be held against me if I publish what I write. What is useful to me may also by accident be useful to another. Moreover, I am not spoiling anything, I am only using what is mine. And if I play the fool, it is at my expense and without harm to anyone. For it is a folly that will die with me, and will have no consequences.</p>\n</blockquote>\n<p>— Montaigne, by way of <a href=\"https://warrenellis.ltd/jot/not-my-teaching-but-my-study/\">Warren Ellis</a></p>\n<p><em>Here&rsquo;s to no consequences&hellip;</em></p>",
				"content_text": "The work of my life, at the moment, appears to be centered around living and acting deliberately. I say \"appears\" because the more I try to do the Work of Life the more I realize I am discovering it rather than creating it. And like all white male explorers, \"discovering\" means \"finding and realizing things that people who don't look like me embraced and celebrated long, long ago.\" \n\n<!--more-->\n\nRight now, this work is manifesting in:\n\n## \"The Path\"\n\n**Daily reading and study into spiritual systems, paths, and modes of thought**, from a perch somewhere between skeptic and seeker. I am just starting this practice, mainly stemming from a desire to spend some daily(ish) time on \"matters of the soul\" - whatever that may mean. Right now that means re-reading one of my favorite nonfiction books, Huston Smith's \"The World's Religions\". I read an utterly beleaguered, decades old, mass market copy of \"The Religions of Man\" as the book was known in the 70's, and inspired in me some spiritual exploration. I think I am hoping it does it again...\n\n\n## \"The Roles\"\n**Abstracting my goals, desires, and pulls into the concept of \"roles\" I want to embody.** I plan to write about this more at length soon. I'm not sure how much I'll get into the personal side of this, but the general idea is that rather than looking at my life as a list of tasks I want to do, or accomplishments I want to rack up, it has helped me to instead envision the archetypal (if only to me) roles, personas or... something close to a D&D class, that I want to embody and explore in my own context. Sounds weird - and it is - but it has also unlocked my brain in certain ways, giving me new and flexible ways to view my life and the things I want to do, and how that informs \"the person I want to be\".  \n\nThis way of looking at my life has also lent itself very well to other projects like...\n\n## \"The Planner\"\n**Developing and iterating over a personal organization system.** I learned long ago I will likely not succeed in a system created by someone else, but for a long time I thought that let me off the hook of having to put the work in to make one myself. I was wrong. I call this project The Planner, though it is not really a \"planner\" or \"datebook\" or \"organizer\" in the traditional sense. The Planner is the tool, or set of tools, I use to organize and manage my time, and to help me catalogue and prioritize what I want to focus on. When those things happen in concert, the Planner turns \"time\" from a vague, ephemeral substance to a finite, consumable resource, a fuel. \n\nThe difference between trying to Do Things without the Planner and with it is the difference between trying to get a Delorean up to 88 MPH in 1885 vs 2015. Without the Planner, to Do Things requires crazy contraptions, mad thinking, and completely impractical and ridiculously inefficient methods of propulsion best suited for singular, Hail Mary moments. With the Planner? I can throw any old junk in my reactor and jet around through time and space causing trouble all I want. AND I get a hover conversion.\n\n_(Wow this post has gone off the rails and right into Clint Eastwood Ravine...)_\n\nOr rather, this would all be true, if the Planner was actually a thing. Now it only exists as the platonic idea of the system I aspire too. But the working prototype I'm up to now is the best, most flexible version I've had yet. Integrating the \"roles\" concept above adds a narrative element to something usually heavy with charts, lists and flow charts. And lucky for me I love narrative elements AND flow charts.\n \n\n## \"The Work\"\n**Developing a practice of making/reflecting/recording...stuff. And things.** Most of my life, I have wanted to create and communicate creatively with the world. I started out in theatre. In my adult life I have settled more into written expression, but that description feels... limiting. In fact for a long time my byline was \"I like making things with words.\" Which is true! Fiction, poetry, but also plays, and code, and zines, and essays, and letters, and... and...\n\nThese are things I would like to create, and I have an inconsistent archive (at best) of various attempts over the years. I have made a few Things I am quite proud of; but what I've never made is a practice of creating them. I can rise to the occasion of an assignment and deadline like nobody's business, but I've never been able to create those stakes for myself. In lieu of someone else's gun to my head, I need to find away to hold my own...\n\nNope. Not even going to go there.\n\n\n## \"The Lexicon\"\n**Building the language and grammar to describe everything above.** All of these projects I'm working on fit together and interact in ways that I'm not going to describe here, in part because I'm still discovering it myself. The questions I'm trying to answer, the practices I'm trying to start, they all swirl around the larger work of finding my place, my way - a project so big it has multiple times swallowed me up deep into its void only to toss my lightyears away, alone and disoriented. It's hard enough to keep my head above water when I can't even talk things through to myself without tripping over the words.\n\n> One day I will find the right words, and they will be simple\n\nI've decided to stop waiting and make that day now. I need the right buckets to sort thoughts and meanings into and finding those buckets is so much harder than it sounds. But having that right word, it's not just a bucket, it's a handle, to pick up an idea and turn it into a tool.\n\nAnd so part of this particular project is giving names to... all the projects. Which I did! Helpful! \n\n***\n\nAt a high level, these are the things I am most excited about, the things - in a certain context - I want to invest my time and energy in, and the things that I believe will give my life meaning. So, I hope to keep a log of how all of these projects are going, what new projects they spawn, and any notable results from the lot of them.\n\nI hope that this space can evolve to be so much more than a process log, but I would also be ecstatic if I maintain it even as just that for any length of time. A process log, perhaps more than anything I could do here, would embody my philosophy for this place, best summed up as:\n\n>What I write here is not my teaching, but my study; it is not a lesson for others, but for me. And yet it should not be held against me if I publish what I write. What is useful to me may also by accident be useful to another. Moreover, I am not spoiling anything, I am only using what is mine. And if I play the fool, it is at my expense and without harm to anyone. For it is a folly that will die with me, and will have no consequences.\n\n — Montaigne, by way of [Warren Ellis](https://warrenellis.ltd/jot/not-my-teaching-but-my-study/)\n\n_Here's to no consequences..._\n",
				"date_published": "2022-07-11T20:19:37-06:00",
				"url": "https://poetryandmadness.micro.blog/2022/07/11/project-log-jul.html"
			},
			{
				"id": "http://poetryandmadness.micro.blog/2022/07/05/log-start.html",
				"title": "Log Start ",
				"content_html": "<p>It is, of course, a cardinal sin to blog about blogging, but it might be even more disrespectful of one&rsquo;s time to use tools without thought and deliberate intention. And this place is a tool, among other things.</p>\n<p><strong>I cleaned out and pulled down the previous iteration of this blog.</strong> Didn&rsquo;t throw anything away, never do. In fact, someday I&rsquo;d really like to create one, consolidated (final?) repository of <em>all</em> of my online writing attempts from across the years and frameworks and services. (#TODO) A single archive could inadvertently make all of this look intentional. Despite how much time I obsess over places like this, I am often a long way from being <em>deliberate</em> with them.</p>\n<p>In such an archive, you would also see just how much of my online writing chases its own tail, compelled to try and justify its existence. Trying and failing, because if you worry about that, you&rsquo;ve missed the point. it&rsquo;s too late.</p>\n<p>And so, I will aim to avoid that here. There&rsquo;s no need to over-complicate this. This is a web log after all, so I am going to try to bring the medium back to its roots: this is a log of what I am doing in and around the web. That&rsquo;s a good place to start. Or, how about this? <strong>this is a log of my life, on the web.</strong>  Even better. Ambiguity intentional.</p>\n<p>this blog is part of a larger system I am building to catalog and engage with my life in creative and interesting ways. the desire to create, hone, and theoretically master these kinds of systems is maybe the great pursuit of my life.</p>\n<p>this writing does not need to justify its own existence. But there is power in defining terms, in naming names, and stating intentions. I have learned that saying things out loud can make real. It activates them, in a way for me. it gives me permission to say and believe them myself.</p>\n<p>Much of the work I&rsquo;ve been doing lately is to settle on an internal vocabulary and grammar to guide my experiences. I am not surprised that work shows up here. But it is a process I don&rsquo;t want to obsess over. I need language to help me move more freely, not to slow me down. I should hope to have a similar relationship with this blog.</p>\n<p>one way to look at this blog is as a tool. another is as a medium. For me the two  meanings can kind of blend together. a painting is the painter&rsquo;s tool (<em>to do what?</em> #comeback) <em>and</em> their media. one can consider this blog from a similar place.</p>\n<p>right now, my list of tools has been whittled down to what I hope are the essentials:</p>\n<ul>\n<li>\n<p>this blog: a public living document. a process log. a workshop. a testing ground. an open mic. a bulletin board.</p>\n</li>\n<li>\n<p>my <a href=\"https://homomonstrosus.com/\">website</a>: a library. a showcase. a temple. a garden. a workshop. and a graveyard. or it could be those things, one day. also: a white whale</p>\n</li>\n<li>\n<p>notebooks: a variety of interconnected journals that are private, analog, but otherwise not that ideologically different than my digital projects - that is - they seek to interestingly and beautifully organize and communicate information</p>\n</li>\n</ul>\n<p>that last point is significant. Much of what I do is about trying to organize and express information in interesting and attractive ways. I <strong>also</strong> want to <em>create</em> engaging and impressive information. These two drives are related, but are not the same pull.</p>\n<p>these are my current tools of expression. or modes. they are not the end results as much as the vehicles. And like many vehicles, they are as fun to tinker with as they are to pilot.</p>\n<p>my goals are to use them efficiently and effectively, but also to enjoy them. one role of this blog is to catalog that journey, along with being an artifact of it, in itself.</p>\n<p>This is the first step on a road I&rsquo;ve been on many many times. This time, the log is running. May it be of use to someone.</p>\n",
				"content_text": "It is, of course, a cardinal sin to blog about blogging, but it might be even more disrespectful of one's time to use tools without thought and deliberate intention. And this place is a tool, among other things. \n\n**I cleaned out and pulled down the previous iteration of this blog.** Didn't throw anything away, never do. In fact, someday I'd really like to create one, consolidated (final?) repository of *all* of my online writing attempts from across the years and frameworks and services. (#TODO) A single archive could inadvertently make all of this look intentional. Despite how much time I obsess over places like this, I am often a long way from being _deliberate_ with them.\n\nIn such an archive, you would also see just how much of my online writing chases its own tail, compelled to try and justify its existence. Trying and failing, because if you worry about that, you've missed the point. it's too late.\n\nAnd so, I will aim to avoid that here. There's no need to over-complicate this. This is a web log after all, so I am going to try to bring the medium back to its roots: this is a log of what I am doing in and around the web. That's a good place to start. Or, how about this? **this is a log of my life, on the web.**  Even better. Ambiguity intentional.\n\nthis blog is part of a larger system I am building to catalog and engage with my life in creative and interesting ways. the desire to create, hone, and theoretically master these kinds of systems is maybe the great pursuit of my life.\n\nthis writing does not need to justify its own existence. But there is power in defining terms, in naming names, and stating intentions. I have learned that saying things out loud can make real. It activates them, in a way for me. it gives me permission to say and believe them myself. \n\nMuch of the work I've been doing lately is to settle on an internal vocabulary and grammar to guide my experiences. I am not surprised that work shows up here. But it is a process I don't want to obsess over. I need language to help me move more freely, not to slow me down. I should hope to have a similar relationship with this blog.\n\none way to look at this blog is as a tool. another is as a medium. For me the two  meanings can kind of blend together. a painting is the painter's tool (_to do what?_ #comeback) _and_ their media. one can consider this blog from a similar place.\n\nright now, my list of tools has been whittled down to what I hope are the essentials:\n\n* this blog: a public living document. a process log. a workshop. a testing ground. an open mic. a bulletin board.\n\n* my [website](https://homomonstrosus.com/): a library. a showcase. a temple. a garden. a workshop. and a graveyard. or it could be those things, one day. also: a white whale\n\n* notebooks: a variety of interconnected journals that are private, analog, but otherwise not that ideologically different than my digital projects - that is - they seek to interestingly and beautifully organize and communicate information\n\nthat last point is significant. Much of what I do is about trying to organize and express information in interesting and attractive ways. I **also** want to _create_ engaging and impressive information. These two drives are related, but are not the same pull.\n\nthese are my current tools of expression. or modes. they are not the end results as much as the vehicles. And like many vehicles, they are as fun to tinker with as they are to pilot. \n\nmy goals are to use them efficiently and effectively, but also to enjoy them. one role of this blog is to catalog that journey, along with being an artifact of it, in itself.\n\nThis is the first step on a road I've been on many many times. This time, the log is running. May it be of use to someone. \n",
				"date_published": "2022-07-05T17:12:13-06:00",
				"url": "https://poetryandmadness.micro.blog/2022/07/05/log-start.html",
				"tags": ["about","meta"]
			},
			{
				"id": "http://poetryandmadness.micro.blog/2022/03/10/considering.html",
				"title": "Considering",
				"content_html": "<p>Well, I&rsquo;m 39 now. Have been for almost 30 hours. So far, so good (all things considered).</p>\n<p>And boy oh boy, do I consider ALL the things.</p>\n<p>In fact, it feels like I&rsquo;ve done nothing for the last 2+ years but consider all the things. In my defense, there&rsquo;s been a lot to consider. But, as is my custom, I&rsquo;ve become fed up with considering and need to do&hellip; something. And this is about the place that I never get past. The precipice of Something. It&rsquo;s always the same. Some arbitrary &lsquo;new beginning&rsquo;. Seizing the supposed energy that comes with a new week, a new month, a new pen, a new notebook, a new year. Because, &lsquo;this time&rsquo; it will be different. However by &lsquo;this time&rsquo; + two weeks it will be basically the same as it ever was.</p>\n<p>Even this, the wry but frustrated observation of past cycles, the &lsquo;first post in months&rsquo; that is destined to be come &lsquo;the last update in weeks&rsquo;,  the soft &lsquo;but maybe&hellip;&rsquo; whispering in the back of my head. The sad sigh that follows. I&rsquo;ve done it all before.</p>\n<p>And so, I am embarrassed.  So often have I tried to jump start something that isn&rsquo;t a car engine. So often have I postured, trying on the costume of the person I want to become, standing in front of the mirror going, &ldquo;wouldn&rsquo;t it just be <em>wild</em> if I just <em>wore</em> this?&rdquo;</p>\n<p>Wouldn&rsquo;t it?</p>\n<p>&ldquo;This time will be different.&rdquo;</p>\n<p>Well, things are certainly&hellip; different. Pandemic. War. And the careening, bucking, lurching, drunken networked, polarized society we live in just throwing itself against the walls of its cage. I can honestly say that life at 39 is different than I expected. I don&rsquo;t know that I ever actually sat down and considered what it would be like to be 39. But I do know I wouldn&rsquo;t have ever considered it would be&hellip; like this.</p>\n<p>So I guess that means it can be anything, that I can be anything.</p>\n<p>It means I don&rsquo;t actually have to come out here and pay my dues by bleeding all over the blogpost, by being just self-deprecating enough, by noting for the record how stupid or privileged or pointless this whole endeavor is, by winkingly insulting myself to wrestle the privilege away from anyone else.</p>\n<p>It means that I can just&hellip; do what I want. Type what I want. Take pictures of what I want. Post what I want, build what I want. Perhaps more importantly, it means I don&rsquo;t have to do&hellip; any of it. I can just be.</p>\n<p>I am sick of death. Lately that is the dense, gaping black hole that lives in the back of my head and perpetually and eventually tugs at all of my thoughts. I can&rsquo;t lose any more down that drain. I need to do&hellip; anything else.</p>\n<p>And so, I am.</p>\n",
				"content_text": "Well, I'm 39 now. Have been for almost 30 hours. So far, so good (all things considered).\n\nAnd boy oh boy, do I consider ALL the things.\n\nIn fact, it feels like I've done nothing for the last 2+ years but consider all the things. In my defense, there's been a lot to consider. But, as is my custom, I've become fed up with considering and need to do... something. And this is about the place that I never get past. The precipice of Something. It's always the same. Some arbitrary 'new beginning'. Seizing the supposed energy that comes with a new week, a new month, a new pen, a new notebook, a new year. Because, 'this time' it will be different. However by 'this time' + two weeks it will be basically the same as it ever was.\n\nEven this, the wry but frustrated observation of past cycles, the 'first post in months' that is destined to be come 'the last update in weeks',  the soft 'but maybe...' whispering in the back of my head. The sad sigh that follows. I've done it all before.\n\nAnd so, I am embarrassed.  So often have I tried to jump start something that isn't a car engine. So often have I postured, trying on the costume of the person I want to become, standing in front of the mirror going, \"wouldn't it just be _wild_ if I just *wore* this?\"\n\nWouldn't it?\n\n\n\"This time will be different.\" \n\nWell, things are certainly... different. Pandemic. War. And the careening, bucking, lurching, drunken networked, polarized society we live in just throwing itself against the walls of its cage. I can honestly say that life at 39 is different than I expected. I don't know that I ever actually sat down and considered what it would be like to be 39. But I do know I wouldn't have ever considered it would be... like this.\n\nSo I guess that means it can be anything, that I can be anything. \n\nIt means I don't actually have to come out here and pay my dues by bleeding all over the blogpost, by being just self-deprecating enough, by noting for the record how stupid or privileged or pointless this whole endeavor is, by winkingly insulting myself to wrestle the privilege away from anyone else.\n\nIt means that I can just... do what I want. Type what I want. Take pictures of what I want. Post what I want, build what I want. Perhaps more importantly, it means I don't have to do... any of it. I can just be.\n\n\nI am sick of death. Lately that is the dense, gaping black hole that lives in the back of my head and perpetually and eventually tugs at all of my thoughts. I can't lose any more down that drain. I need to do... anything else. \n\nAnd so, I am.  \n",
				"date_published": "2022-03-10T19:23:51-06:00",
				"url": "https://poetryandmadness.micro.blog/2022/03/10/considering.html"
			}
	]
}
